[{"kode_matakuliah": "IT-014242", "nama_matakuliah": "KONSEP SISTEM INFORMASI", "sikap": "Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila.; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain.; Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan.; Menginternalisasi nilai, norma, dan etika akademik.; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.; Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu menerapkan pemikiran logis, kritis, inovatif, bermutu dan terukur dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang sesuai dengan bidang keahliannya dalam Sistem Komputer; Mampu menunjukkan kinerja mandiri, bermutu dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi IPTEK sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah, dalam rangka meghasilkan solusi.; Mampu mendeskripsikan secara saintifik sesuai hasil kajiannya dalam bentuk laporan.; Mampu memahami dan menganalisis permasalahan dalam perusahaan terkait dengan pentingnya Sistem Informasi Manajemen dan aliran informasi dalam suatu perusahaan/ organisasi dan memahami lebih mendalam peranan komputer, database dan komunikasi data sebagai alat bantu pada sistem informasi berbasis komputer", "pengetahuan": "Menguasai konsep dan metode Sistem Informasi dan Sistem Informasi Manajemen dalam peranannya terhadap perusahaan/ organisasi; mampu memahami perkembangan sistem informasi berbasis komputer dan dapat memberikan contoh aplikasi serta penerapan sistem informasi di perusahaan", "token": ["kuasa", "konsep", "metode", "sistem", "informasi", "sistem", "informasi", "manajemen", "peran", "usaha", "organisasi", "paham", "kembang", "sistem", "informasi", "bas", "komputer", "contoh", "aplikasi", "terap", "sistem", "informasi", "usaha", "terap", "pikir", "logis", "kritis", "inovatif", "mutu", "ukur", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "sesuai", "bidang", "ahli", "sistem", "komputer", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "iptek", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "meghasilkan", "solusi", "deskripsi", "saintifik", "sesuai", "hasil", "kaji", "bentuk", "lapor", "paham", "analis", "masalah", "usaha", "kait", "sistem", "informasi", "manajemen", "alir", "informasi", "usaha", "organisasi", "paham", "dalam", "peran", "komputer", "database", "komunikasi", "data", "alat", "bantu", "sistem", "informasi", "bas", "komputer"]}, {"kode_matakuliah": "IT0104201", "nama_matakuliah": "Algoritma dan Pemrograman 1", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius.;Menunjukkan sikap bertanggung jawab  atas pekerjaan di bidang keahliannya secara mandiri.;Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu dan kelompok.;Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya.; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur.; Mampu mengkaji implikasi pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, desain atau kritik seni.; Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi.; Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah di bidang keahliannya, berdasarkan hasil analisis informasi dan data.; Mampu memelihara dan mengembangkan jaringan kerja dengan pembimbing, kolega, sejawat baik di dalam maupun di luar lembaganya.; Mampu bertanggungjawab atas pencapaian hasil kerja kelompok dan melakukan supervisi serta evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerja yang berada di bawah tanggungjawabnya.; Mampu melakukan proses evaluasi diri terhadap kelompok kerja yang berada di bawah tanggungjawabnya, dan mampu mengelola pembelajaran secara mandiri.; Mampu mendokumentasikan, menyimpan, mengamankan, dan menemukan kembali data untuk menjamin kesahihan dan mencegah plagiasi.; Mahasiswa mampu merancang system menggunakan flowchart. Dan menerapkan / menjalankannya pada program sederhana.", "pengetahuan": "Mahasiswa mampu menguasai metodologi pengembangan system yaitu, perencanaan, desain, penerapan, pengujian dan pemeliharaan system.; Mahasiswa dapat menganalisis, merancang, dan menerapkan suatu system brbasis komputer secara efisien untuk menyelesaikan masalah, menggunakan program procedural dan berorientasi objek", "token": ["mahasiswa", "kuasa", "metodologi", "kembang", "system", "rencana", "desain", "terap", "uji", "pelihara", "system", "mahasiswa", "analis", "rancang", "terap", "system", "brbasis", "komputer", "efisien", "selesai", "program", "procedural", "orientasi", "objek", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "desain", "kritik", "seni", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru", "ambil", "putus", "konteks", "selesai", "bidang", "ahli", "dasar", "hasil", "analisis", "informasi", "data", "pelihara", "kembang", "jaring", "kerja", "bimbing", "kolega", "jawat", "lembaga", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "supervisi", "evaluasi", "selesai", "kerja", "tugas", "kerja", "tanggungjawabnya", "proses", "evaluasi", "kelompok", "kerja", "tanggungjawabnya", "kelola", "ajar", "mandiri", "dokumentasi", "simpan", "aman", "temu", "data", "jamin", "sahih", "cegah", "plagiasi", "mahasiswa", "rancang", "system", "flowchart", "terap", "jalan", "program", "sederhana"]}, {"kode_matakuliah": "AK-011208", "nama_matakuliah": "Konsep Sistem Informasi Lanjut", "sikap": "Menginternalisasi nilai, norma, dan etika dalam proses  belajar Konsep Sistem Informasi Lanjut; Menunjukkan sikap bertanggungjawabatas pekerjaan dibidang Sistem Informasi secara mandiri.", "keterampilan": "Mampu melakukan analisis proses bisnis pada perusahaan untuk jenis SI korporasi  Enterprise Resource Planning (ERP), Supply Chain Management (SCM) dan Customer Relationship Management (CRM). Melakukan Perancangan Hasil Analisis untuk proses dan database pada  ERP, SCM dan CRM.", "pengetahuan": "Mampu melakukan analisis kebutuhan untuk membangun sistem informasi korporasi(Enterprise Information System), strategi membangun Sistem Informasi(SI)/Teknologi Informasi(TI) pada perusahaan.", "token": ["analisis", "butuh", "bangun", "sistem", "informasi", "korporasienterprise", "information", "system", "strategi", "bangun", "sistem", "informasisiteknologi", "informasiti", "usaha", "analisis", "proses", "bisnis", "usaha", "jenis", "si", "korporasi", "enterprise", "resource", "planning", "erp", "supply", "chain", "management", "scm", "customer", "relationship", "management", "crm", "ancang", "hasil", "analisis", "proses", "database", "erp", "scm", "crm"]}, {"kode_matakuliah": "AK-011211", "nama_matakuliah": "Pemrograman Berbasis Web *", "sikap": "-", "keterampilan": "Mampu melakukan analisis & desain dengan menggunakan kaidah rekayasa software serta algorithmadanpengimplementasian database pada aplikasi berbasis web; Dapat menunjukkan hasil dan kondisi yang maksimal untuk aplikasi bisnis berbasis web.", "pengetahuan": "Mempunyai pengetahuan  dalam penyusunan algorithma pemrograman yang efektif dan efisien; Dapat merancang, membangun dan mendesain aplikasi sistem yang berbasis web secara tepat dan akurat untuk pendukung pengambilan keputusan.", "token": ["tahu", "susun", "algorithma", "pemrograman", "efektif", "efisien", "rancang", "bangun", "desain", "aplikasi", "sistem", "bas", "web", "akurat", "dukung", "ambil", "putus", "analisis", "desain", "kaidah", "rekayasa", "software", "algorithmadanpengimplementasian", "database", "aplikasi", "bas", "web", "hasil", "kondisi", "maksimal", "aplikasi", "bisnis", "bas", "web"]}, {"kode_matakuliah": "AK-011302", "nama_matakuliah": "Analisis Dan Perancangan Sistem Informasi", "sikap": "Dapat berkontribusi dalam peningkatan mutu kehidupan bermasyarakat,berbangsa, dan berdasarkan pancasila serta dapat menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri", "keterampilan": "Mampu memecahkan masalah pekerjaan dengan sifat dan konteks yang sesuai dengan bidang keahlian terapannya didasarkan pada pemikiran logis, inovatif, dan bertanggung jawab atas hasilnya secara mandiri", "pengetahuan": "Menguasai konsep teoritis bidang pengetahuan Sistem Informasi secara umum dan konsep teoritis bagian khusus dalam bidang pengetahuan tersebut secara mendalam, serta mampu memformulasikan penyelesaian masalah prosedural.", "token": ["kuasa", "konsep", "teoritis", "bidang", "tahu", "sistem", "informasi", "konsep", "teoritis", "khusus", "bidang", "tahu", "dalam", "formulasi", "selesai", "prosedural", "pecah", "kerja", "sifat", "konteks", "sesuai", "bidang", "ahli", "terap", "dasar", "pikir", "logis", "inovatif", "tanggung", "hasil", "mandiri"]}, {"kode_matakuliah": "AK-011305", "nama_matakuliah": "INTERAKSI MANUSIA DAN KOMPUTER", "sikap": "1.\tMenunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;   2.\tBertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja kelompok.", "keterampilan": "Mahasiswa mampu memahami pendekatan tingkah laku manusia dalam 2 aspek yaitu  psikologi dan social organisasi dengan obyek obyek interaktif. Mampu merancang dan mengevaluasi obyek yang interaktif. Serta mampu memahami pendekatan human centered.", "pengetahuan": "Mahasiswa memiliki pengetahuan tentang konsep teoritis interaksi manusia dan komputer, konsep perancangan dan analisis interface/web, konsep evaluasi interface/web konsep pemrograman GUI serta konsep multimedia. Sehingga memiliki pengetahuan yang lengkap dalam proses perancangan suatu interface dalam sebuah prototype dan menganalisis sebuah web  dalam   implementasi interaksi manusia dan komputer yang baik dan diharapkan oleh manusia sebagai user.", "token": ["mahasiswa", "milik", "tahu", "konsep", "teoritis", "interaksi", "manusia", "komputer", "konsep", "ancang", "analisis", "interfaceweb", "konsep", "evaluasi", "interfaceweb", "konsep", "pemrograman", "gui", "konsep", "multimedia", "milik", "tahu", "lengkap", "proses", "ancang", "interface", "prototype", "analis", "web", "implementasi", "interaksi", "manusia", "komputer", "harap", "manusia", "user", "mahasiswa", "paham", "dekat", "tingkah", "laku", "manusia", "aspek", "psikologi", "social", "organisasi", "obyek", "obyek", "interaktif", "rancang", "evaluasi", "obyek", "interaktif", "paham", "dekat", "human", "centered"]}, {"kode_matakuliah": "AK011128", "nama_matakuliah": "MANAJEMEN LAYANAN SISTEM INFORMASI", "sikap": "Bekerjasama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara;Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Mampu Menjelaskan konsep dan teori layanan teknologi/sistem Informasi untuk mendukung penganalisaan masalah menerapkan konsep dan teori layanan teknologi/sistem Informasi untuk mendukung layanan organisasi,  Berfikir kritis, mengidentifikasi akar masalah dan pemecahannya secara komprehensif, serta mengambil keputusan yang tepat berdasarkan analisis informasi dan data; Memiliki kemampuan untuk menjadi tenaga profesional untuk pengolahan sistem informasi dan  pengelolaan kualitas layanan TI yang memenuhi kebutuhan bisnis dengan mempertimbangkan kualitas layanan yang mereka berikan dan fokus pada hubungan dengan pelanggan serta memastikan terwujudnya manajemen pelayanan teknologi informasi (IT Services Management) yang prima dan handal.", "pengetahuan": "Menguasai konsep teoritis yang mengkaji, menerapkan dan mengembangkan serta mampu  memformulasikan dan mampu mengambil keputusan yang tepat dalam  penyelesaian masalah Manajemem Layanan Sistem Informasi.", "token": ["kuasa", "konsep", "teoritis", "kaji", "terap", "kembang", "formulasi", "ambil", "putus", "selesai", "manajemem", "layan", "sistem", "informasi", "konsep", "teori", "layan", "teknologisistem", "informasi", "dukung", "penganalisaan", "terap", "konsep", "teori", "layan", "teknologisistem", "informasi", "dukung", "layan", "organisasi", "berfikir", "kritis", "identifikasi", "akar", "pecah", "komprehensif", "ambil", "putus", "dasar", "analisis", "informasi", "data", "milik", "mampu", "tenaga", "profesional", "olah", "sistem", "informasi", "kelola", "kualitas", "layan", "ti", "penuh", "butuh", "bisnis", "timbang", "kualitas", "layan", "fokus", "hubung", "langgan", "wujud", "manajemen", "layan", "teknologi", "informasi", "it", "services", "management", "prima", "handal"]}, {"kode_matakuliah": "AK011204", "nama_matakuliah": "Grafik Komputer dan Pengolahan Citra **", "sikap": "Memiliki integritas professional dan berkomitmen terhadap nilai-nilai etika; Memimpin dan bekerja dalam tim, mandiri dan bertanggung jawab terhadap pekerjaannya; Mendemonstrasikan kemampuan komunikasi lisan dan tulisan yang berkaitan dengan aspek teknis dan non-teknis.", "keterampilan": "Mampu melakukan analisis, desain dan menggunakan algoritma serta perangkat lunak yang sesuai untuk visualisasi grafik 2D/3D; Mampu memanfaatkan algoritma dan perangkat lunak untuk visualisasi grafik yang maksimal; Memiliki kemampuan untuk menjadi tenaga professional dalam mengolah computer grafis dan memiliki kemampuan menulis laporan penelitian dengan baik serta mempresentasikan karya tersebut.", "pengetahuan": "Menjelaskan dasar grafik dari sistem visualisasi presentasi digital manusia; Mengidentifikasi kebutuhan dan teknologi perangkat yang digunakan untuk visualisasi; Menjelaskan dasar model warna dan penggunaannya dalam perangkat yang digunakan untuk menampilkan gambar; Menjelaskan proses visualisasidandasar model geometris; Menguasai berbagai algoritma dasar untuk menampilkan elemen geometris gambar  (titik, garis, lingkaran, ellips); Menguasai algoritma dasar yang dapat digunakan untuk menampilkan perubahan bentuk, posisi dan ukuran gambar; Menguasai konsep dan proses dasar mulai pemodelan sampai dengan visualisasi grafik 3D; Menjelaskan dasar pengolahan gambar; Menjelaskan dan menguasai konsep yang melandasi operasi pengolahan gambar; Menguasai konsep dan beberapa proses yang digunakan untuk meningkatkan kualitas gambar", "token": ["dasar", "grafik", "sistem", "visualisasi", "presentasi", "digital", "manusia", "identifikasi", "butuh", "teknologi", "perangkat", "visualisasi", "dasar", "model", "warna", "guna", "perangkat", "tampil", "gambar", "proses", "visualisasidandasar", "model", "geometris", "kuasa", "algoritma", "dasar", "tampil", "elemen", "geometris", "gambar", "titik", "garis", "lingkar", "ellips", "kuasa", "algoritma", "dasar", "tampil", "ubah", "bentuk", "posisi", "ukur", "gambar", "kuasa", "konsep", "proses", "dasar", "model", "visualisasi", "grafik", "dasar", "olah", "gambar", "kuasa", "konsep", "landas", "operasi", "olah", "gambar", "kuasa", "konsep", "proses", "tingkat", "kualitas", "gambar", "analisis", "desain", "algoritma", "perangkat", "lunak", "sesuai", "visualisasi", "grafik", "dd", "manfaat", "algoritma", "perangkat", "lunak", "visualisasi", "grafik", "maksimal", "milik", "mampu", "tenaga", "professional", "olah", "computer", "grafis", "milik", "mampu", "tulis", "lapor", "teliti", "presentasi", "karya"]}, {"kode_matakuliah": "AK011214", "nama_matakuliah": "Pengantar Simulasi dan Pemodelan", "sikap": "Mampu menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; Dapat berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, dan bernegara berdasarkan Pancasila;  Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; Menunjukkansikapbertanggungjawabataspekerjaan di bidangkeahliannyasecaramandiri.", "keterampilan": "Mampumembandingkansistemdan model, danmenyimpulkanperlunya model untukkebutuhansimulasi; Mampumenggolongkan model fisisdan model matematis, baik yang statismaupundinamis; Mampumenyimpulkanlangkah-langkahdalamstudisimulasisecaragarisbesar.", "pengetahuan": "Mampumemformulasikanmasalahstatisdandinamik; Mampumenentukan data acak yang berdistribusi; Mampumemahamipenggunaandistribusiprobabilitasdalamsimulasi; Mampumemahamipenggunaanfungsidistribusiumum; Mampumemahamipenggunaandistribusiprobabilitas; Mampumenentukanvariabelacak yang berdistribusi", "token": ["mampumemformulasikanmasalahstatisdandinamik", "mampumenentukan", "data", "acak", "distribusi", "mampumemahamipenggunaandistribusiprobabilitasdalamsimulasi", "mampumemahamipenggunaanfungsidistribusiumum", "mampumemahamipenggunaandistribusiprobabilitas", "mampumenentukanvariabelacak", "distribusi", "mampumembandingkansistemdan", "model", "danmenyimpulkanperlunya", "model", "untukkebutuhansimulasi", "mampumenggolongkan", "model", "fisisdan", "model", "matematis", "statismaupundinamis", "mampumenyimpulkanlangkahlangkahdalamstudisimulasisecaragarisbesar"]}, {"kode_matakuliah": "AK011220", "nama_matakuliah": "SISTEM INFORMASI GEOGRAFIS", "sikap": "Bertanggung jawab dan bekerja secara mandiri ataupun kelompok; Melakukan komunikasi dengan baik secara lisan, tulisan dan beretika.", "keterampilan": "Mampu mengoperasikan dan mengenal berbagai macam bidang dalam aplikasi-aplikasi sistem informasi geografis.", "pengetahuan": "Mahasiswa mampu menguasai konsep teoritis bidang pengetahuan; Sistem Informasi geografis secara umum dan konsep teoritis bagian khusus dalam bidang pengetahuan tersebut secara mendalam, serta mampu memformulasikan penyelesaian masalah prosedural.", "token": ["mahasiswa", "kuasa", "konsep", "teoritis", "bidang", "tahu", "sistem", "informasi", "geografis", "konsep", "teoritis", "khusus", "bidang", "tahu", "dalam", "formulasi", "selesai", "prosedural", "operasi", "kenal", "bidang", "aplikasiaplikasi", "sistem", "informasi", "geografis"]}, {"kode_matakuliah": "AK011223", "nama_matakuliah": "Sistem Informasi Sumber Daya Manusia", "sikap": "Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi SISDM; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi ilmu pengetahuan dan teknologi SISDM yang memperhatikan dan menerapkan nilai humaniora berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi/gagasan; Mampu bertanggung jawab atas pencapaian hasil kerja kelompok dan melakukan supervisi serta evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerja yang berada di bawah tanggung jawabnya;", "keterampilan": "Memiliki keterampilan menjelaskan berbagai metodologi pengembangan SISDM; Mampu menjelaskan komponen organisasi, teknologi dan manusia dari SISDM; Mampu menjelaskan bagaimana sebuah SISDM berperan untuk kepentingan kompetitif ; Memiliki kemampuan untuk menjelaskan bagaimana SISDM dapat mendukung proses pengambilan keputusan dalam suatu organisasi", "pengetahuan": "Menguasai konsep teoritis SISDM yang mengkaji, menerapkan dan mengembangkan serta mampuberfikir kritis, mengidentifikasi akar masalah dan pemecahannya secara komprehensif; Mengidentifikasi dampak SISDM terhadap organisasi, aktivitas bisnis, masyarakat maupun individu; Mempunyai pengetahuan SISDM dalam mengambil keputusan yang tepat berdasarkan analisis informasi dan data", "token": ["kuasa", "konsep", "teoritis", "sisdm", "kaji", "terap", "kembang", "mampuberfikir", "kritis", "identifikasi", "akar", "pecah", "komprehensif", "identifikasi", "dampak", "sisdm", "organisasi", "aktivitas", "bisnis", "masyarakat", "individu", "tahu", "sisdm", "ambil", "putus", "dasar", "analisis", "informasi", "data", "milik", "terampil", "metodologi", "kembang", "sisdm", "komponen", "organisasi", "teknologi", "manusia", "sisdm", "sisdm", "peran", "penting", "kompetitif", "milik", "mampu", "sisdm", "dukung", "proses", "ambil", "putus", "organisasi"]}, {"kode_matakuliah": "AK011325", "nama_matakuliah": "Sistem Terdistribusi", "sikap": "-", "keterampilan": "Mampu mengidentifikasi kebutuhan sistem terdistribusi dari suatu organisasi pada sistem terdistribusi.", "pengetahuan": "Menguasai konsep, model, arsitektur dan perangkat keras yang ada pada suatu sistem terdistribusi; Mengetahui berbagai bentuk media komunikasi dan jaringan komputer yang merupakan bagian dari kemajuan teknologi informasi dan komunikasi; Menguasai konsep komunikasi antar proses, konsep basisdata terdistribusi, distribusi pemrosesan, konsep sistem operasi terdistribusi, dan konsep keamanan pada sistem terdistribusi; Mengetahui bentuk dan cara pengembangan sistem terdistribusi.", "token": ["kuasa", "konsep", "model", "arsitektur", "perangkat", "keras", "sistem", "distribusi", "bentuk", "media", "komunikasi", "jaring", "komputer", "maju", "teknologi", "informasi", "komunikasi", "kuasa", "konsep", "komunikasi", "proses", "konsep", "basisdata", "distribusi", "distribusi", "pemrosesan", "konsep", "sistem", "operasi", "distribusi", "konsep", "aman", "sistem", "distribusi", "bentuk", "kembang", "sistem", "distribusi", "identifikasi", "butuh", "sistem", "distribusi", "organisasi", "sistem", "distribusi"]}, {"kode_matakuliah": "IT-012346", "nama_matakuliah": "Elektronika Dasar", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri", "keterampilan": "Mampu melakukan rancang bangun perangkat keras elektronika analog dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Mampu menggunakan dan menerapkan konsep-konsep teoritis dan empiris dalam menyelesaikan masalah di bidang elektronika analog; Menjelaskan teori dan konsep untuk merancang, membuat dan menguji elektronika analog.", "pengetahuan": "Menguasai konsep elektronika analog sehingga mampu untuk mengembangkan dan implementasikan ke dalam aplikasi sistem komputer", "token": ["kuasa", "konsep", "elektronika", "analog", "kembang", "implementasi", "aplikasi", "sistem", "komputer", "rancang", "bangun", "perangkat", "keras", "elektronika", "analog", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "terap", "konsepkonsep", "teoritis", "empiris", "selesai", "bidang", "elektronika", "analog", "teori", "konsep", "rancang", "uji", "elektronika", "analog"]}, {"kode_matakuliah": "IT011234", "nama_matakuliah": "Konsep Data Mining", "sikap": "1.\tBertanggung jawab dan bekerja secara mandiri ataupun kelompok.  2.\tMelakukan komunikasi dengan baik secara lisan, tulisan dan beretika. 3.\tMemiliki sikap untuk belajar seumur hidup (life-long learning).", "keterampilan": "1.\tMampu menganalisa data secara probabilitas dan statistik 2.\tMampu menjelaskan konsep dan teori  yang dipilih untuk menyelesaikan masalah 3.\tDisiplin pada aturan tertulis ataupun tidak tertulis dalam menyajikan hasil analisa 4.\tMampu memilih dan mengambil keputusan dalam menggunakan tools data mining  5.\tMampu menjelaskan berbagai teknik dan metoda pengambilan keputusan dalam metoda pengambilan keputusan dalam pemecahan masalah organisasi  6.\tMenggunakan ICT untuk mendukung bisnis proses", "pengetahuan": "1.\tMampu menjelaskan konsep data mining serta setiap tahapan yang  digunakan dalam data mining. 2.\tMampu memberikan contoh kasus data mining.  3.\tMampu menjelaskan setiap pemodelan yang digunakan berdasarkan  kebutuhan. 4.\tMampu menentukan data mining task yang harus dilakukan sesuai  kebutuhan.", "token": ["konsep", "data", "mining", "tahap", "data", "mining", "contoh", "data", "mining", "model", "dasar", "butuh", "tentu", "data", "mining", "task", "sesuai", "butuh", "menganalisa", "data", "probabilitas", "statistik", "konsep", "teori", "pilih", "selesai", "disiplin", "atur", "tulis", "tulis", "saji", "hasil", "analisa", "pilih", "ambil", "putus", "tools", "data", "mining", "teknik", "metoda", "ambil", "putus", "metoda", "ambil", "putus", "pecah", "organisasi", "ict", "dukung", "bisnis", "proses"]}, {"kode_matakuliah": "IT011308", "nama_matakuliah": "Graf dan Analisis Algoritma", "sikap": "Menunjukkan sikap bertanggungjawab atas pekerjaan dan tugas di bidang keahliannya baik mandiri maupun berkelompok", "keterampilan": "Menguasai konsep teori graph dan analisis algoritma untuk memecahkan berbagai masalah yang berkaitan dengan logika", "pengetahuan": "Memiliki pengetahuan yang baik tentang teori dan konsep graph dan analisis algoritma serta aplikasinya", "token": ["milik", "tahu", "teori", "konsep", "graph", "analisis", "algoritma", "aplikasi", "kuasa", "konsep", "teori", "graph", "analisis", "algoritma", "pecah", "kait", "logika"]}, {"kode_matakuliah": "IT11217", "nama_matakuliah": "PENGANTAR ORGANISASI & ARSITEKTUR KOMPUTER", "sikap": "-", "keterampilan": "Mampu menjelaskan tentang komponen suatu sistem  komputer; Mampu menjelaskan arsitektur dasar sebuah sistem komputer", "pengetahuan": "Memahami arsitektur dasar komputer; Memahami perbedaan antara organisasi dan arsitektur komputer; Memahami kebutuhan sistem operasi dari suatu sistem komputer", "token": ["paham", "arsitektur", "dasar", "komputer", "paham", "beda", "organisasi", "arsitektur", "komputer", "paham", "butuh", "sistem", "operasi", "sistem", "komputer", "komponen", "sistem", "komputer", "arsitektur", "dasar", "sistem", "komputer"]}, {"kode_matakuliah": "PP011201", "nama_matakuliah": "Aplikasi Bisnis Teknologi Informasi", "sikap": "-", "keterampilan": "Mampu menyusun dan mengimplementasikan Rencana Bisnis di bidang Teknologi Informasi dan Komunikasi", "pengetahuan": "1.  Mengetahui konsep, dan aspek bisnis serta mengidentifikasi peluang pada dunia bisnis.  2.  Mengetahui jenis dan tipe bisnis di bidang TIK, serta segmentasi produk dan strategi pemasaran yang sesuai. 3.  Mengetahui jenis-jenis badan usaha dan regulasi serta prosedur pendiriannya. 4.  Mengetahui manajemen SDM perusahaan serta mengetahui komponen-komponen anggaran dan penyusunannya.", "token": ["konsep", "aspek", "bisnis", "identifikasi", "peluang", "dunia", "bisnis", "jenis", "tipe", "bisnis", "bidang", "tik", "segmentasi", "produk", "strategi", "pasar", "sesuai", "jenisjenis", "badan", "usaha", "regulasi", "prosedur", "diri", "manajemen", "sdm", "usaha", "komponenkomponen", "anggar", "susun", "susun", "implementasi", "rencana", "bisnis", "bidang", "teknologi", "informasi", "komunikasi"]}, {"kode_matakuliah": "? IT 1223", "nama_matakuliah": "SISTEM BERBASIS PENGETAHUAN", "sikap": "Berkontribusi, menghargai pendapat orang, bekerjasama, disiplin, bertanggung jawab secara mandiri, menginternalisasi semangat kemandirian.", "keterampilan": "Mampu menunjukkan kinerja mandiri, bermutu dan terukur dengan mengembangkan dan merancang Sistem Berbasis Pengetahuan termasuk perangkat keras dan lunak dan mengoptimalkannya; mampu bekerjasama dan menghargai pendapat dalam penyelesaian tugas kelompok; mampu bertanggungjawab atas pencapaian hasil kerja kelompok dalam bentuk presentasi atau menggunggahnya kedalam laman perguruan tinggi; Mampu menganalisis Sistem Berbasis Pengetahuan sebagai pendukung Sistem Pengambil Keputusan serta mampu merancang, mengembangkan dan mengimplementasikan Sistem Berbasis Pengetahuan kedalam sistem komputer dan sistem tertanam (Embedded System) atau sistem komputasi bergerak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Menguasai konsep dan metode Sistem Berbasis Pengetahuan sebagai pendukung Sistem Penunjang Keputusan; mampu menguasai konsep, metode dan program sehingga mampu untuk menganalisis, merancang, mengembangkan dan mengimplementasikan ke dalam aplikasi sistem komputer.", "token": ["kuasa", "konsep", "metode", "sistem", "bas", "tahu", "dukung", "sistem", "tunjang", "putus", "kuasa", "konsep", "metode", "program", "analis", "rancang", "kembang", "implementasi", "aplikasi", "sistem", "komputer", "kerja", "mandiri", "mutu", "ukur", "kembang", "rancang", "sistem", "bas", "tahu", "perangkat", "keras", "lunak", "optimal", "bekerjasama", "harga", "dapat", "selesai", "tugas", "kelompok", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "bentuk", "presentasi", "menggunggahnya", "dalam", "laman", "guru", "analis", "sistem", "bas", "tahu", "dukung", "sistem", "ambil", "putus", "rancang", "kembang", "implementasi", "sistem", "bas", "tahu", "dalam", "sistem", "komputer", "sistem", "tanam", "embedded", "system", "sistem", "komputasi", "gerak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "AK 000208", "nama_matakuliah": "Jaringan Komputer Lanjut", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika; Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila; Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu memahami dan menganalisis permasalahan dalam bidang pengelolaan Sistem berbasis Komputer dan praktik profesional secara umum dan menguasai konsep teoritis dalam bidang teknologi Jaringan komputer secara mendalam, serta mampu mengimplementasikannya untuk penyelesaian masalah prosedural; Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, desain atau kritik seni; Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi.", "pengetahuan": "Mampu memahami permasalahan pada bidang pengembangan Sistem berbasis Komputer dan praktik profesional khususnya dalam mengembangkan Jaringan Komputer berbasis Mobile Technology dan Embedded System.", "token": ["paham", "masalah", "bidang", "kembang", "sistem", "bas", "komputer", "praktik", "profesional", "kembang", "jaring", "komputer", "bas", "mobile", "technology", "embedded", "system", "paham", "analis", "masalah", "bidang", "kelola", "sistem", "bas", "komputer", "praktik", "profesional", "kuasa", "konsep", "teoritis", "bidang", "teknologi", "jaring", "komputer", "dalam", "implementasi", "selesai", "prosedural", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "desain", "kritik", "seni", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru"]}, {"kode_matakuliah": "AK 012120", "nama_matakuliah": "Keamanan Komputer", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu merancang dan membangun sistem proteksi keamanan pada sistem komputer dan jaringan; Mampu melakukan analisis resiko ancaman, merancang sistem keamanan komputer, dan menguji keamanan sistem komputer dan jaringan.", "pengetahuan": "Memiliki pengetahuan yang memadai tentang ancaman terhadap keamanan sistem komputer dan resikonya. Serta pengetahuan untuk merancang dan membangun sistem proteksi keamanan sistem dan jaringan komputer sesuai dengan resiko dan kebutuhannya.", "token": ["milik", "tahu", "pada", "ancam", "aman", "sistem", "komputer", "resiko", "tahu", "rancang", "bangun", "sistem", "proteksi", "aman", "sistem", "jaring", "komputer", "sesuai", "resiko", "butuh", "rancang", "bangun", "sistem", "proteksi", "aman", "sistem", "komputer", "jaring", "analisis", "resiko", "ancam", "rancang", "sistem", "aman", "komputer", "uji", "aman", "sistem", "komputer", "jaring"]}, {"kode_matakuliah": "AK 012201", "nama_matakuliah": "ANALISA KINERJA SISTEM", "sikap": "Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Menginternalisasinilai,norma,danetikaakademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Mampu mengidentifikasi, menganalisis dan menyelesaikan masalah secara sistematis dan terorganisasi dalam bidang perangkat keras dan jaringan komputer ; Mampu melakukan analisa kinerja sistem perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Mampu menganalisis, mengevaluasi, memilih dan mengfigurasi platform untuk pengembangan dan implementasi aplikasi perangkat dan pelayanannya.", "token": ["analis", "evaluasi", "pilih", "mengfigurasi", "platform", "kembang", "implementasi", "aplikasi", "perangkat", "layan", "identifikasi", "analis", "selesai", "sistematis", "organisasi", "bidang", "perangkat", "keras", "jaring", "komputer", "analisa", "kerja", "sistem", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "AK 012225", "nama_matakuliah": "Teknik Kendali", "sikap": "Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Mampu menganalisis, merancang, implementasi sistem pengaturan ke dalam sistem berbasis komputer; Mampu melakukan analisis dan penyelesaian masalah suatu sistem pengaturan dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Memiliki pengetahuan yang memadai terkait dengan cara kerja sistem pengaturan dan mampu menganalisa dan mengembangkan sistem pengaturan yang ada.", "token": ["milik", "tahu", "pada", "kait", "kerja", "sistem", "atur", "menganalisa", "kembang", "sistem", "atur", "analis", "rancang", "implementasi", "sistem", "atur", "sistem", "bas", "komputer", "analisis", "selesai", "sistem", "atur", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "AK012211", "nama_matakuliah": "Mikroelektronika", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri", "keterampilan": "Mampu mengaplikasikan perangkat lunak dan perangkat keras dalam berbagai area yang berkaitan dengan bidang robotika dan IoT; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi.", "pengetahuan": "Menguasai konsep teoritis tentang perangkat elektronika dan system tertanam baik analog dan digital serta pengantarmuakaan (interfacing) untuk mendukung perancangan sistem tertanam dan IOT.", "token": ["kuasa", "konsep", "teoritis", "perangkat", "elektronika", "system", "tanam", "analog", "digital", "pengantarmuakaan", "interfacing", "dukung", "ancang", "sistem", "tanam", "iot", "aplikasi", "perangkat", "lunak", "perangkat", "keras", "area", "kait", "bidang", "robotika", "iot", "kerja", "mandiri", "mutu", "ukur", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru"]}, {"kode_matakuliah": "AK012212", "nama_matakuliah": "MIKROKOMPUTER", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; 2. Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; 3. Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; 4. Berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; 5. Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; 6. Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; 7. Taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; 8. Menginternalisasi nilai, norma, dan etika akademik; 9. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; 10.Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "1. Mampu menjelaskan teori dan konsep mikrokomputer. 2. Mampu menjelaskan teori dan konsep untuk merancang, membuat dan menguji perangkat mikrokomputer. 3. Menganalisis, mengevaluasi dan optimalisasi arsitektur mikrokomputer termasuk platform mikroprosessornya. 4. Menganalisis, mengevaluasi dan optimalisasi mikroprogramming untuk tujuan tertentu sesuai dengan kebutuhan pengguna dan kesesuaian platform perangkat keras. 5. Menganalisis, mengevaluasi dan memilih platform perangkat lunak dan perangkat keras yang sesuai untuk aplikasi mikrokontroller.", "pengetahuan": "1. Memiliki pengetahuan tentang sejarah perkembangan mikrokomputer dan mikroprosessor . 2. Memiliki pengetahuan, konsep, teknik dan metode mikrokomputer dan mikroprogramming sehingga mampu untuk mengembangkan dan mengimplementasikan ke dalam aplikasi sistem komputer. 3. Mampu menganalisis, mengevaluasi, memilih dan mengkonfigurasi platform mikroprosessor untuk pengembangan dan implementasi aplikasi perangkat keras sistem komputer. 4. Memiliki pengetahuan dasar ilmiah dan mekanisme kerja aplikasi perangkat keras sehingga mampu memecahkan masalah di masyarakat melalui pembuatan model solusi sistem berbasis komputer.", "token": ["milik", "tahu", "sejarah", "kembang", "mikrokomputer", "mikroprosessor", "milik", "tahu", "konsep", "teknik", "metode", "mikrokomputer", "mikroprogramming", "kembang", "implementasi", "aplikasi", "sistem", "komputer", "analis", "evaluasi", "pilih", "konfigurasi", "platform", "mikroprosessor", "kembang", "implementasi", "aplikasi", "perangkat", "keras", "sistem", "komputer", "milik", "tahu", "dasar", "ilmiah", "mekanisme", "kerja", "aplikasi", "perangkat", "keras", "pecah", "masyarakat", "buat", "model", "solusi", "sistem", "bas", "komputer", "teori", "konsep", "mikrokomputer", "teori", "konsep", "rancang", "uji", "perangkat", "mikrokomputer", "analis", "evaluasi", "optimalisasi", "arsitektur", "mikrokomputer", "platform", "mikroprosessornya", "analis", "evaluasi", "optimalisasi", "mikroprogramming", "tuju", "sesuai", "butuh", "guna", "sesuai", "platform", "perangkat", "keras", "analis", "evaluasi", "pilih", "platform", "perangkat", "lunak", "perangkat", "keras", "sesuai", "aplikasi", "mikrokontroller"]}, {"kode_matakuliah": "AK012213", "nama_matakuliah": "ROBOTIKA DASAR", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menganalisis, mengevaluasi, memilih dan mengkonfigurasi beragam sistem robotika yang digunakan untuk mengelola sumber daya sebagai alat teknologi yang mempermudah, mempercepat dan memiliki reliabilitas produksi manusia; Mampu menerapkan pemikiran logis, kritis, inovatif, bermutu dan terukur dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang sesuai dengan bidang keahliannya dalam Sistem Komputer; Mampu menunjukkan kinerja mandiri, bermutu dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi IPTEK sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah, dalam rangka meghasilkan solusi; Mampu mendeskripsikan secara saintifik sesuai hasil kajiannya dalam bentuk laporan teknik.", "pengetahuan": "Menguasai konsep, teori, metode, teknik/algoritma dalam sistem robotika secara sistematis, yang diperoleh melalui penalaran dalam proses pembelajaran, pengalaman kerja dan penelitian yang terkait dengan pembelajaran.", "token": ["kuasa", "konsep", "teori", "metode", "teknikalgoritma", "sistem", "robotika", "sistematis", "oleh", "nalar", "proses", "ajar", "alam", "kerja", "teliti", "kait", "ajar", "analis", "evaluasi", "pilih", "konfigurasi", "agam", "sistem", "robotika", "kelola", "sumber", "daya", "alat", "teknologi", "mudah", "cepat", "milik", "reliabilitas", "produksi", "manusia", "terap", "pikir", "logis", "kritis", "inovatif", "mutu", "ukur", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "sesuai", "bidang", "ahli", "sistem", "komputer", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "iptek", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "meghasilkan", "solusi", "deskripsi", "saintifik", "sesuai", "hasil", "kaji", "bentuk", "lapor", "teknik"]}, {"kode_matakuliah": "AK012214", "nama_matakuliah": "PENGANTARMUKAAN PERIFERAL KOMPUTER", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menganalisis, merancang, implementasi sistem berbasis komputer dan sistem tertanam (Embedded System) dan Mobile Com[puting yang mencakup baik perangkat keras periferal dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Mampu melakukan rancang bangun perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan antarmuka periferal dengan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Mampu menganalisis, mengevaluasi dan memilih platform perangkat lunak dan perangkat keras periferal yang sesuai untuk aplikasi sistem tertanam dan mobile computing riil time.", "token": ["analis", "evaluasi", "pilih", "platform", "perangkat", "lunak", "perangkat", "keras", "periferal", "sesuai", "aplikasi", "sistem", "tanam", "mobile", "computing", "riil", "time", "analis", "rancang", "implementasi", "sistem", "bas", "komputer", "sistem", "tanam", "embedded", "system", "mobile", "computing", "cakup", "perangkat", "keras", "periferal", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "rancang", "bangun", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "antarmuka", "periferal", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "AK012219", "nama_matakuliah": "Sistem Terdistribusi", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menganalisis, merancang, dan mengimplementasi sistem terdistribusi, dan mampu merancang konfigurasi, memasang, dan mengelola jaringan komputer, serta mampu menerapkan sistem komputasi bergerak dan mengelola sumber daya sistem komputasi bergerak yang mencakup perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Memiliki kemampuan untuk mengembangkan perancangan jaringan dan perangkat keras (hardware) dalam organisasi.", "pengetahuan": "Mampu merancang, membuat, menguji, memverifikasi dan memvalidasi sistem digital meliputi komputer, sistem berbasis komputer dan sistem komunikasi.", "token": ["rancang", "uji", "verifikasi", "memvalidasi", "sistem", "digital", "liput", "komputer", "sistem", "bas", "komputer", "sistem", "komunikasi", "analis", "rancang", "implementasi", "sistem", "distribusi", "rancang", "konfigurasi", "pasang", "kelola", "jaring", "komputer", "terap", "sistem", "komputasi", "gerak", "kelola", "sumber", "daya", "sistem", "komputasi", "gerak", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "milik", "mampu", "kembang", "ancang", "jaring", "perangkat", "keras", "hardware", "organisasi"]}, {"kode_matakuliah": "HM 011101", "nama_matakuliah": "ILMU BUDAYA DASAR", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kelompok; Bersikap sesuai dengan tuntutan sosial; Bersikap sesuai dengan tuntutan professional.", "keterampilan": "Mahasiswa mampu menjelaskan tentang konsep-konsep yang dikembangkan untuk mengkaji masalah-masalah manusia dan kebudayaan; Mahasiswa mampu memecahkan masalah, dan sekaligus menyelesaikan tugas-tugas terkait studi kasus masalah manusia dan kebudayaan baik secara soft skills maupun hard skills, menggunakan aplikasi bisnis (software)", "pengetahuan": "Mahasiswa menguasai secara mendalam tentang: 1. Manusia & Cinta Kasih, 2. Manusia & Kesusastraan, 3. Manusia & Keindahan, 4. Manusia & Penderitaan, 5. Manusia &Keadilan, 6. Manusia & Pandangan Hidup, 7. Manusia &Tanggung Jawab serta Pengabdian, 8. Manusia & Kegelisahan, 9. Manusia & Harapan.", "token": ["mahasiswa", "kuasa", "dalam", "manusia", "cinta", "kasih", "manusia", "susastra", "manusia", "indah", "manusia", "derita", "manusia", "adil", "manusia", "pandang", "hidup", "manusia", "tanggung", "abdi", "manusia", "gelisah", "manusia", "harap", "mahasiswa", "konsepkonsep", "kembang", "kaji", "masalahmasalah", "manusia", "budaya", "mahasiswa", "pecah", "selesai", "tugastugas", "kait", "studi", "manusia", "budaya", "soft", "skills", "hard", "skills", "aplikasi", "bisnis", "software"]}, {"kode_matakuliah": "HM-012102", "nama_matakuliah": "ILMU SOSIAL DASAR", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kelompok; Bersikap sesuai dengan tuntutan sosial; Bersikap sesuai dengan tuntutan professional.", "keterampilan": "Mahasiswa mampu memecahkan masalah, dan sekaligus menyelesaikan tugas-tugas terkait studi kasus sosial masyarakat baik secara soft skills maupun hard skills, menggunakan aplikasi bisnis (software); Mampu menggunakan pendekatan sosial dan budaya dalam setiap upaya mencari solusi atas pemecahan dari masalah alam yang dihadapi mahasiswa Jurusan Teknik ybs sehingga mahasiswa sebagai calon ilmuwan dan profesional, mampu bertindak secara arif dan bijaksana", "pengetahuan": "Mahasiswa mampu menguasai secara mendalam pengetahuan tentang.Ilmu Sosial Dasar sebagai Mata Kuliah Dasar Umu,Penduduk dan Masyarakat,Individu,keluarga dan Masyrarakat,Pemuda dan sosialisasi, Warga Negara dan Negara, Pelapisan Sosialo dan Kesamaan drajat, Masyarakat pedesaan dan Masyarakat perkotaan,,Pertentangan sosial dan Integrasi masyaraakat,Ilmu pengetahuan teknologi dan kemiskinan,Agama dan masyarakat.", "token": ["mahasiswa", "kuasa", "dalam", "tahu", "tentangilmu", "sosial", "dasar", "mata", "kuliah", "dasar", "umupenduduk", "masyarakatindividukeluarga", "masyrarakatpemuda", "sosialisasi", "warga", "negara", "negara", "lapis", "sosialo", "sama", "drajat", "masyarakat", "desa", "masyarakat", "perkotaanpertentangan", "sosial", "integrasi", "masyaraakatilmu", "tahu", "teknologi", "kemiskinanagama", "masyarakat", "mahasiswa", "pecah", "selesai", "tugastugas", "kait", "studi", "sosial", "masyarakat", "soft", "skills", "hard", "skills", "aplikasi", "bisnis", "software", "dekat", "sosial", "budaya", "upaya", "cari", "solusi", "pecah", "alam", "hadap", "mahasiswa", "jurus", "teknik", "ybs", "mahasiswa", "calon", "ilmuwan", "profesional", "tindak", "arif", "bijaksana"]}, {"kode_matakuliah": "IT 011203", "nama_matakuliah": "Algoritma & Pemrograman 2B*", "sikap": "1. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri. 2. Menginternalisasi nilai, norma, dan etika akademis;", "keterampilan": "Mampu menganalisis, merancang, implementasi sistem berbasis komputer yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik menggunakan C++.", "pengetahuan": "Mahasiswa mampu menganalisis, mengevaluasi, memilih dan mengkonfigurasi platform untuk pengembangan dan implementasi aplikasi perangkat dan pelayanannya. Mahasiswa mempunyai pengetahuan dasar ilmiah dan mekanisme kerja komputer sehingga mampu memecahkan masalah melalui pembuatan model solusi sistem berbasis komputer.", "token": ["mahasiswa", "analis", "evaluasi", "pilih", "konfigurasi", "platform", "kembang", "implementasi", "aplikasi", "perangkat", "layan", "mahasiswa", "tahu", "dasar", "ilmiah", "mekanisme", "kerja", "komputer", "pecah", "buat", "model", "solusi", "sistem", "bas", "komputer", "analis", "rancang", "implementasi", "sistem", "bas", "komputer", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik"]}, {"kode_matakuliah": "IT 011212", "nama_matakuliah": "MATEMATIKA LANJUT 1", "sikap": "Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahlian secara mandiri khususnya keahlian dasar matematika seperti vektor, ruang vektor,matriks, determinan, persamaan linier, dan transformasi linier.", "keterampilan": "Menguasai konsep teori matematika khususnya teori vektor, ruang vektor,matriks, determinan, persamaan linier, dan transformasi linier untuk memecahkan berbagai masalah yang berkaitan dengan logika.", "pengetahuan": "Memiliki pengetahuan yang memadai terkait teori-teori dasar matematika seperti vektor, ruang vektor,matriks, determinan, persamaan linier, transformasi linier dan aplikasinya sehingga mampu menguasai pengembangan ilmu matematika yang digunakan untuk menganalisa sistem berbasis komputer.", "token": ["milik", "tahu", "pada", "kait", "teoriteori", "dasar", "matematika", "vektor", "ruang", "vektormatriks", "determinan", "sama", "linier", "transformasi", "linier", "aplikasi", "kuasa", "kembang", "ilmu", "matematika", "menganalisa", "sistem", "bas", "komputer", "kuasa", "konsep", "teori", "matematika", "teori", "vektor", "ruang", "vektormatriks", "determinan", "sama", "linier", "transformasi", "linier", "pecah", "kait", "logika"]}, {"kode_matakuliah": "IT 012119", "nama_matakuliah": "Praktikum Robotika", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu dan kelompok; Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "Mampu menganalisis, merancang konsep, maupun membuat implementasi rangkaian perangkat periperal; Memiliki kemampuan untuk membedakan jenis-jenis perangkat periperal; Mampu melakukan analisis komunikasi data serial; Mampu melakukan analisis komunikasi data paralel;", "pengetahuan": "Mengenal pemrograman borland delphi 7, dan Bahasa pemrograman pascal; Mengetahui jenis-jenis perangkat peripheral; Mengetahui transmisi data serial dan paralel.", "token": ["kenal", "pemrograman", "borland", "delphi", "bahasa", "pemrograman", "pascal", "jenisjenis", "perangkat", "peripheral", "transmisi", "data", "serial", "paralel", "analis", "rancang", "konsep", "implementasi", "rangkai", "perangkat", "periperal", "milik", "mampu", "beda", "jenisjenis", "perangkat", "periperal", "analisis", "komunikasi", "data", "serial", "analisis", "komunikasi", "data", "paralel"]}, {"kode_matakuliah": "IT 012130", "nama_matakuliah": "Praktikum Algoritma Pemrograman 1", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2. Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri. 3. Bertanggung jawab secara profesionaldan etikterhadap pencapaianhasil kerjaindividu dan kelompok. 4. Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "1. Memiliki pengetahuan dan keterampilan dalam merancang Algoritma dalam pemrograman. 2. Mampu merancang,membuat, dan menguji Algoritma untuk memecahkan masalah 3. Mampu mengungkapkan hasil pembelajaran praktikum dalam sebuah proyek program aplikasi", "pengetahuan": "1. Menguasai konsep dan prinsip algoritma yang dapat digunakan dalam mendesain sistem berbasis komputer. 2. Menguasai konsep-konsep Bahasa pemrograman serta mampu membandingkan berbagai model Bahasa pemrograman Visual Basic dan Delphi. 3. Mengetahui cara menganalisis dan merancang suatu sistem berbasis komputer secara efisien untuk menyelelesaikan masalah menggunakan pemrograman prosedural dan berorientasi objek.", "token": ["kuasa", "konsep", "prinsip", "algoritma", "desain", "sistem", "bas", "komputer", "kuasa", "konsepkonsep", "bahasa", "pemrograman", "banding", "model", "bahasa", "pemrograman", "visual", "basic", "delphi", "analis", "rancang", "sistem", "bas", "komputer", "efisien", "menyelelesaikan", "pemrograman", "prosedural", "orientasi", "objek", "milik", "tahu", "terampil", "rancang", "algoritma", "pemrograman", "merancangmembuat", "uji", "algoritma", "pecah", "hasil", "ajar", "praktikum", "proyek", "program", "aplikasi"]}, {"kode_matakuliah": "IT 012131", "nama_matakuliah": "Praktikum Algoritma Pemrograman 2", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2. Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri. 3. Bertanggung jawab secara profesionaldan etikterhadap pencapaianhasil kerjaindividu dan kelompok. 4. Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "1. Mampu memiliki pengetahuan tentangkonsep-konsep dan prinsip algoritma serta konsep Bahasa pemrograman untuk merancang, membuat dan menguji algoritma dalam sebuah proyek program aplikasi. 2. Memiliki pengetahuan dan keterampilan dalam merancang Algoritma dalam pemrograman. 3. Mampu merancang,membuat, dan menguji Algoritma untuk memecahkan masalah 4. Mampu mengungkapkan hasil pembelajaran praktikum dalam sebuah proyek program aplikasi", "pengetahuan": "1. Menguasai konsep dan prinsip algoritma yang dapat digunakan dalam mendesain sistem berbasis komputer. 2. Menguasai konsep-konsep Bahasa pemrograman serta mampu membandingkan berbagai model Bahasa pemrograman C++ 3. Mengetahui cara menganalisis dan merancang suatu sistem berbasis komputer secara efisien untuk menyelelesaikan masalah menggunakan pemrograman prosedural dan berorientasi objek.", "token": ["kuasa", "konsep", "prinsip", "algoritma", "desain", "sistem", "bas", "komputer", "kuasa", "konsepkonsep", "bahasa", "pemrograman", "banding", "model", "bahasa", "pemrograman", "analis", "rancang", "sistem", "bas", "komputer", "efisien", "menyelelesaikan", "pemrograman", "prosedural", "orientasi", "objek", "milik", "tahu", "tentangkonsepkonsep", "prinsip", "algoritma", "konsep", "bahasa", "pemrograman", "rancang", "uji", "algoritma", "proyek", "program", "aplikasi", "milik", "tahu", "terampil", "rancang", "algoritma", "pemrograman", "merancangmembuat", "uji", "algoritma", "pecah", "hasil", "ajar", "praktikum", "proyek", "program", "aplikasi"]}, {"kode_matakuliah": "IT 012158", "nama_matakuliah": "Praktikum Mikroprosesor", "sikap": "Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan;  Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Mampu menyelesaikan pekerjaan berlingkup luas dan menganalisis data dengan beragam metode yang sesuai, baik yang belum maupun yang sudah baku; Mampu menunjukkan kinerja bermutu dan terukur; Mampu memecahkan masalah pekerjaan dengan sifat dan konteks yang sesuai dengan bidang keahlian terapannya didasarkan pada pemikiran logis, inovatif, dan bertanggung jawab atas hasilnya secara mandiri; Mampu mendokumentasikan, menyimpan, mengamankan, dan menemukan kembali data untuk menjamin kesahihan dan mencegah plagiasi; Mampu merancang, mengembangkan (memprogram) dan mengaplikasikan sistem tertanam untuk berbagai keperluan pengontrolan dan pengendalian maupun instrumentasi (dalam skala kecil) sesuai dengan kebutuhan pengguna", "pengetahuan": "Menguasai pengetahuan dasar matematika dan elektronika serta algoritma pemrograman. Mengetahui struktur dan arsitektur berbagai jenis mikrokontroller serta platform bahasa pemrogramannya. Menguasai pengetahuan sistem perangkat keras digital termasuk berbagai cara kerja dan fungsi sensor dan actuator untuk dapat membuat sistem instrumentasi dan control elektronik berbasis komputer.", "token": ["kuasa", "tahu", "dasar", "matematika", "elektronika", "algoritma", "pemrograman", "struktur", "arsitektur", "jenis", "mikrokontroller", "platform", "bahasa", "pemrogramannya", "kuasa", "tahu", "sistem", "perangkat", "keras", "digital", "kerja", "fungsi", "sensor", "actuator", "sistem", "instrumentasi", "control", "elektronik", "bas", "komputer", "selesai", "kerja", "lingkup", "luas", "analis", "data", "agam", "metode", "sesuai", "baku", "kerja", "mutu", "ukur", "pecah", "kerja", "sifat", "konteks", "sesuai", "bidang", "ahli", "terap", "dasar", "pikir", "logis", "inovatif", "tanggung", "hasil", "mandiri", "dokumentasi", "simpan", "aman", "temu", "data", "jamin", "sahih", "cegah", "plagiasi", "rancang", "kembang", "program", "aplikasi", "sistem", "tanam", "perlu", "kontrol", "kendali", "instrumentasi", "skala", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT 012161", "nama_matakuliah": "Praktikum Sistem Tertanam", "sikap": "Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Mampu merancang, mengembangkan (memprogram) dan mengaplikasikan sistem tertanam untuk berbagai keperluan pengontrolan dan pengendalian maupun instrumentasi (dalam skala kecil) sesuai dengan kebutuhan pengguna; Mampu menyelesaikan pekerjaan berlingkup luas dan menganalisis data dengan beragam metode yang sesuai, baik yang belum maupun yang sudah baku; Mampu menunjukkan kinerja bermutu dan terukur; Mampu memecahkan masalah pekerjaan dengan sifat dan konteks yang sesuai dengan bidang keahlian terapannya didasarkan pada pemikiran logis, inovatif, dan bertanggung jawab atas hasilnya secara mandiri; Mampu mendokumentasikan, menyimpan, mengamankan, dan menemukan kembali data untuk menjamin kesahihan dan mencegah plagiasi.", "pengetahuan": "Menguasai pengetahuan dasar matematika dan elektronika serta algoritma pemrograman. Mengetahui struktur dan arsitektur berbagai jenis mikrokontroller serta platform bahasa pemrogramannya. Menguasai pengetahuan sistem perangkat keras digital termasuk berbagai cara kerja dan fungsi sensor dan actuator untuk dapat membuat sistem instrumentasi dan control elektronik berbasis komputer.", "token": ["kuasa", "tahu", "dasar", "matematika", "elektronika", "algoritma", "pemrograman", "struktur", "arsitektur", "jenis", "mikrokontroller", "platform", "bahasa", "pemrogramannya", "kuasa", "tahu", "sistem", "perangkat", "keras", "digital", "kerja", "fungsi", "sensor", "actuator", "sistem", "instrumentasi", "control", "elektronik", "bas", "komputer", "rancang", "kembang", "program", "aplikasi", "sistem", "tanam", "perlu", "kontrol", "kendali", "instrumentasi", "skala", "sesuai", "butuh", "guna", "selesai", "kerja", "lingkup", "luas", "analis", "data", "agam", "metode", "sesuai", "baku", "kerja", "mutu", "ukur", "pecah", "kerja", "sifat", "konteks", "sesuai", "bidang", "ahli", "terap", "dasar", "pikir", "logis", "inovatif", "tanggung", "hasil", "mandiri", "dokumentasi", "simpan", "aman", "temu", "data", "jamin", "sahih", "cegah", "plagiasi"]}, {"kode_matakuliah": "IT 012163", "nama_matakuliah": "Praktikum Jaringan Komputer Dasar", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu dan kelompok; Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "Mampu menganalisis, merancang, mengimplementasi sebuah jaringan komputer, serta mampu menerapkan sistem jaringan komputer dan mengelola sumber daya jaringan yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna;  Memiliki kemampuan dalam pembangunan dan pemeliharaan sebuah jaringan komputer; Mampu merancang, membuat, menguji, memverifikasi dan memvalidasi Jaringan komputer; Mampu melakukan konfigurasi jaringan serta mengetahui tingkat kesalahannya.", "pengetahuan": "Mengetahui macam topologi jaringan dan protocol pendukungnya; Mengenal konfigurasi IP; Mengenal segala jenis perangkat jaringan komputer.", "token": ["topologi", "jaring", "protocol", "dukung", "kenal", "konfigurasi", "ip", "kenal", "jenis", "perangkat", "jaring", "komputer", "analis", "rancang", "implementasi", "jaring", "komputer", "terap", "sistem", "jaring", "komputer", "kelola", "sumber", "daya", "jaring", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "milik", "mampu", "bangun", "pelihara", "jaring", "komputer", "rancang", "uji", "verifikasi", "memvalidasi", "jaring", "komputer", "konfigurasi", "jaring", "tingkat", "salah"]}, {"kode_matakuliah": "IT 012202", "nama_matakuliah": "Algoritma & Pemrograman 2A", "sikap": "1. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri. 2. Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mahasiswa mampu melakukan rancang bangun perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna. Mahasiswa mampu bertanggungjawab atas pencapaian hasil kerja kelompok dan melakukan supervisi dan evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerja yang berada di bawah tanggungjawabnya.", "pengetahuan": "Mahasiswa mempunyai pengetahuan dasar ilmiah dan mekanisme kerja komputer sehingga mampu memecahkan masalah melalui pembuatan model solusi sistem berbasis komputer. Mahasiswa mampu menganalisis, mengevaluasi dan memilih platform perangkat lunak dan perangkat keras yang sesuai untuk aplikasi pendukung dan sistem tertanam riil time", "token": ["mahasiswa", "tahu", "dasar", "ilmiah", "mekanisme", "kerja", "komputer", "pecah", "buat", "model", "solusi", "sistem", "bas", "komputer", "mahasiswa", "analis", "evaluasi", "pilih", "platform", "perangkat", "lunak", "perangkat", "keras", "sesuai", "aplikasi", "dukung", "sistem", "tanam", "riil", "time", "mahasiswa", "rancang", "bangun", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "mahasiswa", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "supervisi", "evaluasi", "selesai", "kerja", "tugas", "kerja", "tanggungjawabnya"]}, {"kode_matakuliah": "IT 012207", "nama_matakuliah": "Elektronika Lanjut", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious 2. Menginternalisasi nilai, norma, dan etika akademik; 3. Menunjukkan sikap bertanggungjawab atas pekerjaan dibidang keahliannya secara mandiri", "keterampilan": "Mampu menganalisis, merancang, implementasi sistem kontrol yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Memahami teori dan konsep untuk merancang, membuat dan menguji sistem kontrol; Merancang sistem kontrol sederhana.", "pengetahuan": "Menguasai konsep, teknik dan sistem kontrol sehingga memiliki kemampuan merancang maupun menganalisis bidang otomasi baik skala kecil maupun kontrol sistem yang diimplementasikan ke dalam aplikasi sistem komputer.", "token": ["kuasa", "konsep", "teknik", "sistem", "kontrol", "milik", "mampu", "rancang", "analis", "bidang", "otomasi", "skala", "kontrol", "sistem", "implementasi", "aplikasi", "sistem", "komputer", "analis", "rancang", "implementasi", "sistem", "kontrol", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "paham", "teori", "konsep", "rancang", "uji", "sistem", "kontrol", "rancang", "sistem", "kontrol", "sederhana"]}, {"kode_matakuliah": "IT 012217", "nama_matakuliah": "Matematika Diskrit 1", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika; menginternalisasi nilai, norma, dan etika akademik; berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain;", "keterampilan": "Menguasai konsep dan teori konsep-konsep struktur diskrit, yang meliputi materi dasar matematika yang digunakan untuk memodelkan dan menganalisis sistem komputasi. ? ?", "pengetahuan": "Memiliki pengetahuan yang berhubungan dengan masalah masalah pemilahan data (himpunan), logika matematika.", "token": ["milik", "tahu", "hubung", "pilah", "data", "himpun", "logika", "matematika", "kuasa", "konsep", "teori", "konsepkonsep", "struktur", "diskrit", "liput", "materi", "dasar", "matematika", "model", "analis", "sistem", "komputasi"]}, {"kode_matakuliah": "IT 012218", "nama_matakuliah": "Matematika Diskrit 2", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2. Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri. 3. Menginternalisasi nilai, norma, dan etika akademik; 4. Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "1. Mampu menjelaskan konsep matematika diskrit dan mengaplikasikannya untuk memodelkan dan menganalisis sistem komputer dalam menyelesaikan masalah/ kebutuhan pengguna. 2. Mampu menyelesaikan operasi dasar vektor dan ruang vektor. 3. Mampu menyelesaikan operasi dasar, determinan matriks, dan invers matriks. 4. Mampu menggunakan sistem persamaan linier dan transformasi linier untuk menyelesaikan masalah sistem berbasis komputer. 5. Mampu menerapkan konsep teori matematika yang logis dan sistematis sebagai penunjang dalam membangun model sistem dan menyelesaikan masalah di bidang sistem berbasis komputer. 6. Mampu menggunakan teknik, keterampilan dan alat bantu 7. Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah sistem komputer.", "pengetahuan": "1. Mengetahui konsep dan operasi dasar vektor dan ruang vektor secara umum untuk menyelesaikan masalah sistem komputer 2. Mengetahui konsep teoritis matriks, determinan dan matriks invers untuk memodelkan dan menganalisis sistem komputer. 3. Menguasai cara kerja dalam menyelesaikan masalah menggunakan sistem persamaan linier dan transformasi linier.", "token": ["konsep", "operasi", "dasar", "vektor", "ruang", "vektor", "selesai", "sistem", "komputer", "konsep", "teoritis", "matriks", "determinan", "matriks", "invers", "model", "analis", "sistem", "komputer", "kuasa", "kerja", "selesai", "sistem", "sama", "linier", "transformasi", "linier", "konsep", "matematika", "diskrit", "aplikasi", "model", "analis", "sistem", "komputer", "selesai", "butuh", "guna", "selesai", "operasi", "dasar", "vektor", "ruang", "vektor", "selesai", "operasi", "dasar", "determinan", "matriks", "invers", "matriks", "sistem", "sama", "linier", "transformasi", "linier", "selesai", "sistem", "bas", "komputer", "terap", "konsep", "teori", "matematika", "logis", "sistematis", "tunjang", "bangun", "model", "sistem", "selesai", "bidang", "sistem", "bas", "komputer", "teknik", "terampil", "alat", "bantu", "ambil", "putus", "konteks", "selesai", "sistem", "komputer"]}, {"kode_matakuliah": "IT 012220", "nama_matakuliah": "Matematika Lanjut 2 *", "sikap": "Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahlian secara mandiri khususnya keahlian dasar matematika seperti persamaan diferensial sederhana, PD linier orde n, PD parsial, dan transformasi Laplace.", "keterampilan": "1. Mampu menggunakan dan menerapkan konsep teori matematika dan aplikasinya sebagai penunjang mata kuliah matematika lainnya yang lebih tinggi dalam menyelesaikan masalah di bidang sistem berbasis komputer. 2. Mampu menjelaskan konsep teori matematika khususnya persamaan diferensial sederhana, PD linier orde n, PD parsial, dan transformasi Laplace untuk memecahkan berbagai masalah yang berkaitan dengan sistem komputer. 3. Mampu menyelesaikan masalah persamaan diferensial dan transformasi Laplace. 4. Mampu menentukan transformasi Laplace dari suatu fungsi dan invers dari transformasi Laplace. 5. Mampu menguasai konsep persamaan diferensial, yang meliputi persamaan` diferensial sederhana, PD linier orde n dan transformasi Laplace yang digunakan untuk memodelkan dan menganalisis sistem komputasi.", "pengetahuan": "1. Menguasai konsep persamaan diferensial sederhana, PD linier orde n, melalui beberapa metode yang dapat diterapkan, 2. Menguasai transformasi Laplace dan invers transformasi Laplace serta penggunaannya dalam penyelesaian masalah Persamaan Diferensial.", "token": ["kuasa", "konsep", "sama", "diferensial", "sederhana", "pd", "linier", "orde", "metode", "terap", "kuasa", "transformasi", "laplace", "invers", "transformasi", "laplace", "guna", "selesai", "sama", "diferensial", "terap", "konsep", "teori", "matematika", "aplikasi", "tunjang", "mata", "kuliah", "matematika", "selesai", "bidang", "sistem", "bas", "komputer", "konsep", "teori", "matematika", "sama", "diferensial", "sederhana", "pd", "linier", "orde", "pd", "parsial", "transformasi", "laplace", "pecah", "kait", "sistem", "komputer", "selesai", "sama", "diferensial", "transformasi", "laplace", "tentu", "transformasi", "laplace", "fungsi", "invers", "transformasi", "laplace", "kuasa", "konsep", "sama", "diferensial", "liput", "sama", "diferensial", "sederhana", "pd", "linier", "orde", "transformasi", "laplace", "model", "analis", "sistem", "komputasi"]}, {"kode_matakuliah": "IT 012233", "nama_matakuliah": "SIMULASI DAN PEMODELAN", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu melakukan rancang bangun perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Mampu menganalisis, merancang, implementasi sistem berbasis komputer dan sistem tertanam (Embedded System) yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Mampu menganalisis, mengevaluasi, memilih dan mengfigurasi platform untuk pengembangan dan implementasi aplikasi perangkat lunak dan pelayanannya.", "token": ["analis", "evaluasi", "pilih", "mengfigurasi", "platform", "kembang", "implementasi", "aplikasi", "perangkat", "lunak", "layan", "rancang", "bangun", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "analis", "rancang", "implementasi", "sistem", "bas", "komputer", "sistem", "tanam", "embedded", "system", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT 012234", "nama_matakuliah": "SISTEM BERBASIS PENGETAHUAN*", "sikap": "Berkontribusi, menghargai pendapat orang, bekerjasama, disiplin, bertanggung jawab secara mandiri, menginternalisasi semangat kemandirian.", "keterampilan": "Mampu menganalisis Sistem Berbasis Pengetahuan sebagai pendukung Sistem Pengambil Keputusan serta mampu merancang, mengembangkan dan mengimplementasikan Sistem Berbasis Pengetahuan kedalam sistem komputer dan sistem tertanam (Embedded System) atau sistem komputasi bergerak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.; Mampu menunjukkan kinerja mandiri, bermutu dan terukur dengan mengembangkan dan merancang Sistem Berbasis Pengetahuan termasuk perangkat keras dan lunak dan mengoptimalkannya; mampu bekerjasama dan menghargai pendapat dalam penyelesaian tugas kelompok; mampu bertanggungjawab atas pencapaian hasil kerja kelompok dalam bentuk presentasi atau menggunggahnya kedalam laman perguruan tinggi;", "pengetahuan": "Menguasai konsep dan metode Sistem Berbasis Pengetahuan sebagai pendukung Sistem Penunjang Keputusan; mampu menguasai konsep, metode dan program sehingga mampu untuk menganalisis, merancang, mengembangkan dan mengimplementasikan ke dalam aplikasi sistem komputer.", "token": ["kuasa", "konsep", "metode", "sistem", "bas", "tahu", "dukung", "sistem", "tunjang", "putus", "kuasa", "konsep", "metode", "program", "analis", "rancang", "kembang", "implementasi", "aplikasi", "sistem", "komputer", "analis", "sistem", "bas", "tahu", "dukung", "sistem", "ambil", "putus", "rancang", "kembang", "implementasi", "sistem", "bas", "tahu", "dalam", "sistem", "komputer", "sistem", "tanam", "embedded", "system", "sistem", "komputasi", "gerak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "kerja", "mandiri", "mutu", "ukur", "kembang", "rancang", "sistem", "bas", "tahu", "perangkat", "keras", "lunak", "optimal", "bekerjasama", "harga", "dapat", "selesai", "tugas", "kelompok", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "bentuk", "presentasi", "menggunggahnya", "dalam", "laman", "guru"]}, {"kode_matakuliah": "IT 012235", "nama_matakuliah": "SISTEM DIGITAL", "sikap": "Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Menginternalisasinilai,norma,danetikaakademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Mampu menganalisis, merancang, implementasi sistem berbasis komputer dan sistem tertanam (Embedded System) yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Mampu melakukan rancang bangun perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Menguasai konsep elektronika analog dan digital sehingga mampu untuk mengembangkan dan implementasikan ke dalam aplikasi sistem komputer", "token": ["kuasa", "konsep", "elektronika", "analog", "digital", "kembang", "implementasi", "aplikasi", "sistem", "komputer", "analis", "rancang", "implementasi", "sistem", "bas", "komputer", "sistem", "tanam", "embedded", "system", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "rancang", "bangun", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT 012236", "nama_matakuliah": "SISTEM OPERASI", "sikap": "a. bertaqwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; b. menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; c. berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; d. berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; e. menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; f. bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; g. taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara h. menginternalisasi nilai, norma, dan etika akademik; i. menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secaramandiri; j. menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan", "keterampilan": "Mampu menganalisis, mengevaluasi, memilih dan mengkonfigurasi beragam sistem operasi yang digunakan untuk mengelola sumber daya perangkat keras komputer atau hardware termasuk penyediaan layanan umum untuk aplikasi perangkat lunak, sebagai suatu solusi terhadap masalah optimalisasi kinerja komputer.", "pengetahuan": "Menguasai konsep, teori, metode, teknik/algoritma mengenai sistem operasi komputer secara sistematis, yang diperoleh melalui penalaran dalam proses pembelajaran, pengalaman kerja dan penelitian yang terkait dengan pembelajaran.", "token": ["kuasa", "konsep", "teori", "metode", "teknikalgoritma", "sistem", "operasi", "komputer", "sistematis", "oleh", "nalar", "proses", "ajar", "alam", "kerja", "teliti", "kait", "ajar", "analis", "evaluasi", "pilih", "konfigurasi", "agam", "sistem", "operasi", "kelola", "sumber", "daya", "perangkat", "keras", "komputer", "hardware", "sedia", "layan", "aplikasi", "perangkat", "lunak", "solusi", "optimalisasi", "kerja", "komputer"]}, {"kode_matakuliah": "IT 012239", "nama_matakuliah": "Struktur Data", "sikap": "1. Dapat berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, dan bernegara berdasarkan Pancasila 2. Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan 3. Dapat menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain 4. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri 5. Menginternalisasi nilai, norma, dan etika akademik 6. Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "1. Mampu mengorganisasikan data dan menguasai susunan data dalam bentuk linear, stack dan tree. 2. Mampu mendesign suatu coding sederhana berdasarkan pengetahuan dasar tentang pendeklarasian data pada susunan dan struktur data. 3. Mampu membuat program aplikasi untuk aplikasi teknik pencarian dan pengurutan data.", "pengetahuan": "Mahasiswa diharapkan mampu memberikan pemahaman pengorganisasi data pada sistem komputer, yang nantinya digunakan untuk mendisain suatu program dalam Bahasa Pemrograman tertentu.", "token": ["mahasiswa", "harap", "paham", "organisasi", "data", "sistem", "komputer", "disain", "program", "bahasa", "pemrograman", "organisasi", "data", "kuasa", "susun", "data", "bentuk", "linear", "stack", "tree", "mendesign", "coding", "sederhana", "dasar", "tahu", "dasar", "deklarasi", "data", "susun", "struktur", "data", "program", "aplikasi", "aplikasi", "teknik", "cari", "urut", "data"]}, {"kode_matakuliah": "IT 012250", "nama_matakuliah": "Interaksi Manusia dan Komputer", "sikap": "Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Menginternalisasi nilai, norma, dan etika akademik; Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu menerapkan konsep-konsep dasar pengembangan perangkat lunak dan kecakapan yang berhubungan dengan proses pengembangan perangkat lunak serta mampu membuat program untuk meningkatkan efektifitas penggunaan komputer untuk memecahkan masalah tertentu; Mampu mengaplikasikan perangkat lunak dalam berbagai area yang berkaitan dengan bidang robotika dan IoT; Mampu mengkaji implikasi pengembangan atau implementasi IPTEK yang memperhatikan dan menerapkan nilai humaniora sesuai keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, gagasan, desain, atau kritik seni; Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah di bidang keahliannya, berdasarkan hasil analisis informasi dan data; Mampu bertanggung jawab atas pencapaian hasil kerja kelompok dan melakukan supervisi serta evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerja yang berada di bawah tanggung jawabnya.", "pengetahuan": "Menguasai konsep teoritis algoritma dan kompleksitas (AL) serta bahasa pemrograman yang meliputi bahasa pemrograman berbasis desktop maupun bahasa pemrograman berbasis platform; Menguasi konsep teoritis rekayasa perangkat lunak untuk memformulasikan penyelesaian masalah procedural.", "token": ["kuasa", "konsep", "teoritis", "algoritma", "kompleksitas", "al", "bahasa", "pemrograman", "liput", "bahasa", "pemrograman", "bas", "desktop", "bahasa", "pemrograman", "bas", "platform", "kuasi", "konsep", "teoritis", "rekayasa", "perangkat", "lunak", "formulasi", "selesai", "procedural", "terap", "konsepkonsep", "dasar", "kembang", "perangkat", "lunak", "cakap", "hubung", "proses", "kembang", "perangkat", "lunak", "program", "tingkat", "efektifitas", "guna", "komputer", "pecah", "aplikasi", "perangkat", "lunak", "area", "kait", "bidang", "robotika", "iot", "kaji", "implikasi", "kembang", "implementasi", "iptek", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "gagas", "desain", "kritik", "seni", "ambil", "putus", "konteks", "selesai", "bidang", "ahli", "dasar", "hasil", "analisis", "informasi", "data", "tanggung", "capai", "hasil", "kerja", "kelompok", "supervisi", "evaluasi", "selesai", "kerja", "tugas", "kerja", "tanggung"]}, {"kode_matakuliah": "IT 012254", "nama_matakuliah": "Pemrograman Devais FPGA", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; 2. Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; 3. Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; 4. Berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; 5. Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain;", "keterampilan": "Mampu menganalisis, merancang, dan mengimplementasikan sebuah sistem digital pada sebuah FPGA maupun CPLD serta memjabarkan dan mengevaluasi kualitas dari karakteristik implementasi.", "pengetahuan": "Memiliki pengetahuan yang memadai terkait dengan cara kerja FPGA dan mampu merancang dan mengembangkan berbagai desain produk berbasis digital.", "token": ["milik", "tahu", "pada", "kait", "kerja", "fpga", "rancang", "kembang", "desain", "produk", "bas", "digital", "analis", "rancang", "implementasi", "sistem", "digital", "fpga", "cpld", "memjabarkan", "evaluasi", "kualitas", "karakteristik", "implementasi"]}, {"kode_matakuliah": "IT 012255", "nama_matakuliah": "KOMUNIKASI DATA", "sikap": "- Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius - Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; - Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; - Berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; - Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; - Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan;", "keterampilan": "Mampu menggunakan dan menerapkan konsep-konsep teoritis dan empiris dalam menyelesaikan masalah mengenai sistem komunikasi di bidang perangkat keras dan jaringan komputer; Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya dalam Sistem Komputer; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur;  Mampu menyusun deskripsi saintifik hasil kajiannya dalam bentuk skripsi atau laporan tugas akhir; Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah di bidang keahliannya, berdasarkan hasil analisis informasi dan data; Memiliki kemampuan untuk mengembangkan perancangan jaringan dan perangkat keras (hardware) dalam organisasi.", "pengetahuan": "Memahami konsep dasar dan memperoleh gambaran mengenai komunikasi data dan jaringan serta memahami persoalan dasar mengenai sistem komunikasi sehingga mampu untuk mengembangkan dan implemetasi kedalam aplikasi sistem komputer.", "token": ["paham", "konsep", "dasar", "oleh", "gambar", "komunikasi", "data", "jaring", "paham", "dasar", "sistem", "komunikasi", "kembang", "implemetasi", "dalam", "aplikasi", "sistem", "komputer", "terap", "konsepkonsep", "teoritis", "empiris", "selesai", "sistem", "komunikasi", "bidang", "perangkat", "keras", "jaring", "komputer", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "sistem", "komputer", "kerja", "mandiri", "mutu", "ukur", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "ambil", "putus", "konteks", "selesai", "bidang", "ahli", "dasar", "hasil", "analisis", "informasi", "data", "milik", "mampu", "kembang", "ancang", "jaring", "perangkat", "keras", "hardware", "organisasi"]}, {"kode_matakuliah": "IT 012268", "nama_matakuliah": "SISTEM KOMPUTASI BERGERAK", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu merancang konfigurasi, memasang, dan mengelola jaringan komputer, serta mampu menerapkan sistem komputasi bergerak dan mengelola sumber daya sistem komputasi bergerak yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Memiliki kemampuan untuk mengembangkan perancangan jaringan dan perangkat keras (hardware) dalam organisasi.", "pengetahuan": "Menguasai tehnologi dan metode program dalam mobile computing sehingga mampu untuk merancang, mengembangkan dan implementasikan ke aplikasi mobile computing.", "token": ["kuasa", "tehnologi", "metode", "program", "mobile", "computing", "rancang", "kembang", "implementasi", "aplikasi", "mobile", "computing", "rancang", "konfigurasi", "pasang", "kelola", "jaring", "komputer", "terap", "sistem", "komputasi", "gerak", "kelola", "sumber", "daya", "sistem", "komputasi", "gerak", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "milik", "mampu", "kembang", "ancang", "jaring", "perangkat", "keras", "hardware", "organisasi"]}, {"kode_matakuliah": "IT 012276", "nama_matakuliah": "ROBOTIKA", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menganalisis, mengevaluasi, memilih dan mengkonfigurasi beragam sistem robotika (meliputi bio-robotika, mobile robot, robot vision dan robotika industri) yang dapat dimanfaatkan untuk mengelola sumber daya sebagai alat teknologi yang mempermudah, mempercepat dan memiliki reliabilitas produksi manusia; Mampu menerapkan pemikiran logis, kritis, inovatif, bermutu dan terukur dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang sesuai dengan bidang keahliannya dalam Sistem Komputer; Mampu menunjukkan kinerja mandiri, bermutu dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi IPTEK sesuai dengan keahliannya; Mampu mendeskripsikan secara saintifik sesuai hasil kajiannya dalam bentuk laporan teknik", "pengetahuan": "Menguasai konsep, teori, metode, teknik/algoritma dan implementasi sistem robotika secara sistematis, yang diperoleh dari proses pembelajaran, pengalaman kerja dan penelitian yang terkait dengan pembelajaran.", "token": ["kuasa", "konsep", "teori", "metode", "teknikalgoritma", "implementasi", "sistem", "robotika", "sistematis", "oleh", "proses", "ajar", "alam", "kerja", "teliti", "kait", "ajar", "analis", "evaluasi", "pilih", "konfigurasi", "agam", "sistem", "robotika", "liput", "biorobotika", "mobile", "robot", "robot", "vision", "robotika", "industri", "manfaat", "kelola", "sumber", "daya", "alat", "teknologi", "mudah", "cepat", "milik", "reliabilitas", "produksi", "manusia", "terap", "pikir", "logis", "kritis", "inovatif", "mutu", "ukur", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "sesuai", "bidang", "ahli", "sistem", "komputer", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "iptek", "sesuai", "ahli", "deskripsi", "saintifik", "sesuai", "hasil", "kaji", "bentuk", "lapor", "teknik"]}, {"kode_matakuliah": "IT 01230", "nama_matakuliah": "Algoritma dan Pemrograman 1A", "sikap": "1. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; 2. Menginternalisasi nilai, norma, dan etika akademis;", "keterampilan": "Mahasiswa mampu menunjukan kinerja mandiri, bermutu, dsn terukur. Mahasiswa mampu bertanggungjawab atas pencapaian hasil kerja kelompok dan melakukan supervise dan evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerjaan yang berada di bawah tanggung jawabnya.", "pengetahuan": "Mahasiswa mampu menguasai metodologi pengembangan system yaitu, perencanaan, desain, penerapan, pengujian dan pemeliharaan system. Mahasiswa dapat menganalisis, merancang, dan menerapkan suatu system brbasis komputer secara efisien untuk menyelesaikan masalah, menggunakan program procedural dan berorientasi objek.", "token": ["mahasiswa", "kuasa", "metodologi", "kembang", "system", "rencana", "desain", "terap", "uji", "pelihara", "system", "mahasiswa", "analis", "rancang", "terap", "system", "brbasis", "komputer", "efisien", "selesai", "program", "procedural", "orientasi", "objek", "mahasiswa", "tunjuk", "kerja", "mandiri", "mutu", "dsn", "ukur", "mahasiswa", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "supervise", "evaluasi", "selesai", "kerja", "tugas", "kerja", "tanggung"]}, {"kode_matakuliah": "IT 012301", "nama_matakuliah": "Algoritma & Pemrograman 1 B*", "sikap": "Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Menginternalisasi nilai, norma, dan etika akademis;", "keterampilan": "Mahasiswa mampu menunjukan kinerja mandiri, bermutu dan terukur. Mahasiswa mampu bertanggungjawab atas pencapaian hasil kerja kelompok dan melakukan supervise dan evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerjaan yang berada di bawah tanggung jawabnya.", "pengetahuan": "Mahasiswa mampu menguasai metodologi pengembangan system yaitu, perencanaan, desain, penerapan, pengujian dan pemeliharaan system. Mahasiswa dapat menganalisis, merancang, dan menerapkan suatu system brbasis komputer secara efisien untuk menyelesaikan masalah, menggunakan program procedural dan berorientasi objek.", "token": ["mahasiswa", "kuasa", "metodologi", "kembang", "system", "rencana", "desain", "terap", "uji", "pelihara", "system", "mahasiswa", "analis", "rancang", "terap", "system", "brbasis", "komputer", "efisien", "selesai", "program", "procedural", "orientasi", "objek", "mahasiswa", "tunjuk", "kerja", "mandiri", "mutu", "ukur", "mahasiswa", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "supervise", "evaluasi", "selesai", "kerja", "tugas", "kerja", "tanggung"]}, {"kode_matakuliah": "IT 012316", "nama_matakuliah": "Matematika Dasar 2A", "sikap": "1. Dapat berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, dan bernegara berdasarkan Pancasila 2. Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan 3. Dapat menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain 4. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri 5. Menginternalisasi nilai, norma, dan etika akademik 6. Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "1. Mahasiswa memahami konsep dasar integral dan mengetahui jenis integral secara umum 2. Mahasiswa mampu menyelesaikan masalah-masalah perhitungan dan penerapannya dengan metode integral. 3. Mahasiswa memahami konsep dasar integral dan mengetahui jenis integral secara umum 4. Mahasiswa mampu menyelesaikan masalah-masalah perhitungan dan penerapannya dengan metode integral.", "pengetahuan": "Mahasiswa diharapkan mampu memberikan pemahaman tentang konsep dasar integral dan perhitungan dengan metode integral", "token": ["mahasiswa", "harap", "paham", "konsep", "dasar", "integral", "hitung", "metode", "integral", "mahasiswa", "paham", "konsep", "dasar", "integral", "jenis", "integral", "mahasiswa", "selesai", "masalahmasalah", "hitung", "terap", "metode", "integral", "mahasiswa", "paham", "konsep", "dasar", "integral", "jenis", "integral", "mahasiswa", "selesai", "masalahmasalah", "hitung", "terap", "metode", "integral"]}, {"kode_matakuliah": "IT 012343", "nama_matakuliah": "RANGKAIAN LISTRIK & SISTEM LINIER", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika; menginternalisasi nilai, norma, dan etika akademik; berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan pancasila; bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan; menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "1. Mampu memanfaatkan IPTEKS di bidang teknologi perangkat keras dan jaringan komputer 2. Mampu mengidentifikasi, menganalisis dan menyelesaikan masalah secara sistematis dan terorganisasi dalam bidang perangkat keras dan jaringan komputer 3. Mampu menggunakan dan menerapkan konsep-konsep teoritis dan empiris dalam menyelesaikan masalah di bidang perangkat keras dan jaringan komputer 4. Mampu mengaplikasikan ilmu di bidang teknologi perangkat keras dan jaringan komputer untuk menciptakan lapangan kerja", "pengetahuan": "Menguasai teori, metode, dan/atau falsafah bidang ilmu rangkaian listrik & Sistem Linier secara sistematis yang diperoleh melalui penalaran dalam proses pembelajaran, pengalaman kerja mahasiswa, penelitian dan/atau pengabdian kepada masyarakat yang terkait pembelajaran.", "token": ["kuasa", "teori", "metode", "danatau", "falsafah", "bidang", "ilmu", "rangkai", "listrik", "sistem", "linier", "sistematis", "oleh", "nalar", "proses", "ajar", "alam", "kerja", "mahasiswa", "teliti", "danatau", "abdi", "masyarakat", "kait", "ajar", "manfaat", "ipteks", "bidang", "teknologi", "perangkat", "keras", "jaring", "komputer", "identifikasi", "analis", "selesai", "sistematis", "organisasi", "bidang", "perangkat", "keras", "jaring", "komputer", "terap", "konsepkonsep", "teoritis", "empiris", "selesai", "bidang", "perangkat", "keras", "jaring", "komputer", "aplikasi", "ilmu", "bidang", "teknologi", "perangkat", "keras", "jaring", "komputer", "cipta", "lapang", "kerja"]}, {"kode_matakuliah": "IT 012346", "nama_matakuliah": "Elektronika Dasar", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious 2. Menginternalisasi nilai, norma, dan etika akademik 3. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri", "keterampilan": "1. Mampu menggunakan dan menerapkan konsep-konsep teoritis dan empiris dalam menyelesaikan masalah di bidang elektronika analog 2. Menjelaskan teori dan konsep untuk merancang, membuat dan menguji elektronika analog. 3. Mampu melakukan rancang bangun perangkat keras elektronika analog dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Menguasai konsep elektronika analog sehingga mampu untuk mengembangkan dan implementasikan ke dalam aplikasi sistem komputer", "token": ["kuasa", "konsep", "elektronika", "analog", "kembang", "implementasi", "aplikasi", "sistem", "komputer", "terap", "konsepkonsep", "teoritis", "empiris", "selesai", "bidang", "elektronika", "analog", "teori", "konsep", "rancang", "uji", "elektronika", "analog", "rancang", "bangun", "perangkat", "keras", "elektronika", "analog", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT 012360", "nama_matakuliah": "Sistem Tertanam / Embeded Sistem", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menunjukkan kinerja bermutu dan terukur dengan sifat serta konteks yang sesuai bidang keahlian terapannya didasarkan pada pemikiran logis, inovatif, dan bertanggung jawab atas hasilnya secara mandiri; Mahasiswa dapat mengetahui, memahami, menguasai dan mampu membuat/mengimplementasikan perangkat keras/lunak sistem Tertanam / embeded sesuai dengan kebutuhan pengguna berdasarkan perkembangan terkini.", "pengetahuan": "Menguasai penggunaan mikrokontroler arduino dan MCS dengan pemrograman bahasa C dan Pemrograman Java pada Sistem operasi Android Mengetahui perkembangan terkini dari perangkat keras maupun perangkat lunaknya untuk dapat merancang sistem sesuai dengan kebutuhan pengguna.", "token": ["kuasa", "guna", "mikrokontroler", "arduino", "mcs", "pemrograman", "bahasa", "pemrograman", "java", "sistem", "operasi", "android", "kembang", "kini", "perangkat", "keras", "perangkat", "lunak", "rancang", "sistem", "sesuai", "butuh", "guna", "kerja", "mutu", "ukur", "sifat", "konteks", "sesuai", "bidang", "ahli", "terap", "dasar", "pikir", "logis", "inovatif", "tanggung", "hasil", "mandiri", "mahasiswa", "paham", "kuasa", "membuatmengimplementasikan", "perangkat", "keraslunak", "sistem", "tanam", "embeded", "sesuai", "butuh", "guna", "dasar", "kembang", "kini"]}, {"kode_matakuliah": "IT 014347", "nama_matakuliah": "Organisasi dan Arsitektur Komputer", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious 2. Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika 3. Dapat berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa 4. Dapat berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, dan bernegara berdasarkan Pancasila 5. Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan", "keterampilan": "1. Mahasiswa mampu menciptakan atau merakit sebuah komputer yang memenuhi kebutuhan fungsional kinerja 2. Mahasiswa dapat merealisasikan aspek organisasional teknologi hardware, perangkat antar muka, teknologi memori, dan sinyal kontrol 3. Mahasiswa dapat menjelaskan teknik pengalamatan, aritmetika yang digunakan, mekanisme IO 4. Mahasiswa mampu menjelaskan sifat dan karakteristik organisasi dan arsitektur komputer 5. Mahasiswa mampu menjelaskan struktur dan fungsi organisasi dan arsitektur komputer", "pengetahuan": "Secara umum setelah mendapatkan matakuliah ini mahasiswa diharapkan mampu memberikan pemahaman tentang organisasi dan arsitektur komputer.", "token": ["matakuliah", "mahasiswa", "harap", "paham", "organisasi", "arsitektur", "komputer", "mahasiswa", "cipta", "rakit", "komputer", "penuh", "butuh", "fungsional", "kerja", "mahasiswa", "realisasi", "aspek", "organisasional", "teknologi", "hardware", "perangkat", "muka", "teknologi", "memori", "sinyal", "kontrol", "mahasiswa", "teknik", "alamat", "aritmetika", "mekanisme", "io", "mahasiswa", "sifat", "karakteristik", "organisasi", "arsitektur", "komputer", "mahasiswa", "struktur", "fungsi", "organisasi", "arsitektur", "komputer"]}, {"kode_matakuliah": "IT 041226", "nama_matakuliah": "DASAR-DASAR TELEKOMUNIKASI", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2. Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri. 3. Bertanggung jawabsecara profesionaldan etikterhadap pencapaianhasil kerjaindividu dan kelompok. 4. Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "Memiliki kemampuan untuk mengembangkan perancangan jaringan dan perangkat keras (hardware) dalam sistem telekomunikasi; Mampu menggunakan dan menerapkan konsep-konsep teoritis dan empiris dalam menyelesaikan masalah di bidang perangkat keras dan sistem telekomunikasi.", "pengetahuan": "Memiliki pengetahuan tentang prinsip-prinsip komunikasi dalam sistem telekomunikasi.", "token": ["milik", "tahu", "prinsipprinsip", "komunikasi", "sistem", "telekomunikasi", "milik", "mampu", "kembang", "ancang", "jaring", "perangkat", "keras", "hardware", "sistem", "telekomunikasi", "terap", "konsepkonsep", "teoritis", "empiris", "selesai", "bidang", "perangkat", "keras", "sistem", "telekomunikasi"]}, {"kode_matakuliah": "IT 045233", "nama_matakuliah": "Teknik Riset Operasi", "sikap": "Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Menginternalisasi nilai, norma, dan etika akademik; Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu mengaplikasikan konsep matematika, logika, statistik, serta struktur diskrit yang digunakan untuk memodelkan dan menganalisis system komputasi dalam menyelesaikan masalah/kebutuhan pengguna; Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Mampu menunjukkan kinerja mandiri, bermutu dan terukur; Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi; Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah di bidang keahliannya, berdasarkan hasil analisis informasi dan data", "pengetahuan": "Menguasai konsep teoritis matematika, logika, probabilitas dan statistik secara umum untuk menyelesaikan masalah sistem komputasi.", "token": ["kuasa", "konsep", "teoritis", "matematika", "logika", "probabilitas", "statistik", "selesai", "sistem", "komputasi", "aplikasi", "konsep", "matematika", "logika", "statistik", "struktur", "diskrit", "model", "analis", "system", "komputasi", "selesai", "masalahkebutuhan", "guna", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru", "ambil", "putus", "konteks", "selesai", "bidang", "ahli", "dasar", "hasil", "analisis", "informasi", "data"]}, {"kode_matakuliah": "IT 12234", "nama_matakuliah": "KONSEP SISTEM INFORMASI B", "sikap": "Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;  Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu menerapkan pemikiran logis, kritis, inovatif, bermutu dan Mampu menerapkan pemikiran logis, kritis, inovatif, bermutu dan terukur dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang sesuai dengan bidang keahliannya dalam Sistem Komputer; Mampu menunjukkan kinerja mandiri, bermutu dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi IPTEK sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah, dalam rangka meghasilkan solusi; Mampu mendeskripsikan secara saintifik sesuai hasil kajiannya dalam bentuk laporan; Mampu memahami dan menganalisis permasalahan dalam basis data dan merancang serta menuliskannya kedalam pemrograman yang mendukung konsep basis data (dBase, SQL, Microsoft Access).", "pengetahuan": "Menguasai konsep basis data dan alat bantu/ perangkat lunak yang dapat digunakan sebagai pengolah basis data; mampu memahami penggunaan dan cara kerja permrograman dBase, SQL, dan pengolahan data dengan Microsoft Access meliputi tabel, form, report dan query.", "token": ["kuasa", "konsep", "basis", "data", "alat", "bantu", "perangkat", "lunak", "olah", "basis", "data", "paham", "guna", "kerja", "permrograman", "dbase", "sql", "olah", "data", "microsoft", "access", "liput", "tabel", "form", "report", "query", "terap", "pikir", "logis", "kritis", "inovatif", "mutu", "terap", "pikir", "logis", "kritis", "inovatif", "mutu", "ukur", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "sesuai", "bidang", "ahli", "sistem", "komputer", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "iptek", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "meghasilkan", "solusi", "deskripsi", "saintifik", "sesuai", "hasil", "kaji", "bentuk", "lapor", "paham", "analis", "masalah", "basis", "data", "rancang", "tulis", "dalam", "pemrograman", "dukung", "konsep", "basis", "data", "dbase", "sql", "microsoft", "access"]}, {"kode_matakuliah": "IT-012132", "nama_matakuliah": "PRAKTIKUM FISIKA DASAR 1", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; 2. Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; 3. Dapat berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; 4. Dapat berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; 5. Dapat bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; 6. Dapat menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; 7. Taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; 8. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; 9. Menginternalisasi nilai, norma dan etika akademik; 10. Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan;", "keterampilan": "1. Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; 2. Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; 3. Mampu mengkaji implikasi pengembangan atau implementasi IPTEK yang memperhatikan dan menerapkan nilai humaniora sesuai keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, gagasan, desain, dan kritik seni; 4. Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi;", "pengetahuan": "1. Menguasai teori dan konsep ilmu alamiah dasar (fisika) terutama tentang mekanika, gelombang, kelistrikan dan karakteristik material 2. Menerapkan konsep ilmu alamiah dasar dalam bidang elektronika dan komputer 3. Menguasai dan menerapkan konsep teoretis sains, aplikasi fisika dalam rekayasa, prinsip-prinsip rekayasa (engineering fundamentals), sains rekayasa dan perancangan rekayasa yang diperlukan untuk analisis dan perancangan sistem komputer serta komponen- komponen yang diperlukan. 4. Mampu menerapkan fisika, sains, dan prinsip rekayasa (engineering principles) untuk menyelesaikan masalah rekayasa yang kompleks (complex engineering problem) pada sistem komputer. 5. Mampu memformulasikan dan menganalisis permasalahan serta Pengetahuan mengembangkan suatu sistem penyelesaian yang menerapkan ilmu pengetahuan dan teknologi dalam bidang sistem komputer. 6. Menguasai konsep integritas akademik secara umum dan konsep plagiarism secara khusus, dalam hal jenis plagiarism, konsekuensi pelanggaran dan upaya pencegahannya 7. Mampu berkomunikasi dengan efektif, salah satunya adalah penguasaan Bahasa Inggris, memiliki etika bermasyarakat dan selalu berperan aktif dalam meningkatkan kesejahteraan masyarakat. 8. Mampu berkompetisi dengan lulusan perguruan tinggi lain dan berorientasi global.", "token": ["kuasa", "teori", "konsep", "ilmu", "alamiah", "dasar", "fisika", "mekanika", "gelombang", "listrik", "karakteristik", "material", "terap", "konsep", "ilmu", "alamiah", "dasar", "bidang", "elektronika", "komputer", "kuasa", "terap", "konsep", "teoretis", "sains", "aplikasi", "fisika", "rekayasa", "prinsipprinsip", "rekayasa", "engineering", "fundamentals", "sains", "rekayasa", "ancang", "rekayasa", "analisis", "ancang", "sistem", "komputer", "komponen", "komponen", "terap", "fisika", "sains", "prinsip", "rekayasa", "engineering", "principles", "selesai", "rekayasa", "kompleks", "complex", "engineering", "problem", "sistem", "komputer", "formulasi", "analis", "masalah", "tahu", "kembang", "sistem", "selesai", "terap", "ilmu", "tahu", "teknologi", "bidang", "sistem", "komputer", "kuasa", "konsep", "integritas", "akademik", "konsep", "plagiarism", "khusus", "jenis", "plagiarism", "konsekuensi", "langgar", "upaya", "cegah", "komunikasi", "efektif", "salah", "satu", "kuasa", "bahasa", "inggris", "milik", "etika", "masyarakat", "peran", "aktif", "tingkat", "sejahtera", "masyarakat", "kompetisi", "lulus", "guru", "orientasi", "global", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "iptek", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "gagas", "desain", "kritik", "seni", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru"]}, {"kode_matakuliah": "IT011226", "nama_matakuliah": "Statistika 1", "sikap": "Mampu menunjukkan internalisasi nilai, norma, dan etika akademik.;Mampu menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.;Mampu menunjukkan internalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu meningkatkan kompetensi mahasiswa melalui proses belajar secara centered learning dan mutakhir dengan dukungan TIK di Program studi Sistem Informasi  jenjang strata-1 Fakultas Ilmu Komputer dan Teknologi Informasi Universitas Gunadarma.  Mampu membekali mahasiswa dengan pemahaman aspek-aspek Statistika Deskriptif dan cara penerapan metoda Statistik Deskriptif dalam bentuk kasus-kasus. Mampu mendeskripsikan, merumuskan dan menjelaskan Statistik Deskriptif dan contoh kasus tersebut dengan baik dan sistematis.", "pengetahuan": "Membekali mahasiswa agar lebih paham dan menguasai teori terkait  data dan cara pengumpulan data melalui pengumpulan data secara mandiri oleh mahasiswa.", "token": ["bekal", "mahasiswa", "paham", "kuasa", "teori", "kait", "data", "kumpul", "data", "kumpul", "data", "mandiri", "mahasiswa", "tingkat", "kompetensi", "mahasiswa", "proses", "ajar", "centered", "learning", "mutakhir", "dukung", "tik", "program", "studi", "sistem", "informasi", "jenjang", "strata", "fakultas", "ilmu", "komputer", "teknologi", "informasi", "universitas", "gunadarma", "bekal", "mahasiswa", "paham", "aspekaspek", "statistika", "deskriptif", "terap", "metoda", "statistik", "deskriptif", "bentuk", "kasuskasus", "deskripsi", "rumus", "statistik", "deskriptif", "contoh", "sistematis"]}, {"kode_matakuliah": "IT011227", "nama_matakuliah": "Statistika 2", "sikap": "Mampu menunjukkan internalisasi nilai, norma, dan etika akademik.;Mampu menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.;\tMampu menunjukkan internalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu meningkatkan kompetensi mahasiswa melalui proses belajar secara centered learning dan mutakhir dengan dukungan TIK di Program studi Sistem Informasi  jenjang strata-1 Fakultas Ilmu Komputer dan Teknologi Informasi Universitas Gunadarma.;  Mampu membekali mahasiswa dengan pemahaman aspek-aspek Statistika Deskriptif dan cara penerapan metoda Statistik Deskriptif dalam bentuk kasus-kasus.; Mampu mendeskripsikan, merumuskan dan menjelaskan Statistik Deskriptif dan contoh kasus tersebut dengan baik dan sistematis.", "pengetahuan": "Membekali mahasiswa agar lebih paham dan menguasai teori terkait  data dan cara pengumpulan data melalui pengumpulan data secara mandiri oleh mahasiswa.", "token": ["bekal", "mahasiswa", "paham", "kuasa", "teori", "kait", "data", "kumpul", "data", "kumpul", "data", "mandiri", "mahasiswa", "tingkat", "kompetensi", "mahasiswa", "proses", "ajar", "centered", "learning", "mutakhir", "dukung", "tik", "program", "studi", "sistem", "informasi", "jenjang", "strata", "fakultas", "ilmu", "komputer", "teknologi", "informasi", "universitas", "gunadarma", "bekal", "mahasiswa", "paham", "aspekaspek", "statistika", "deskriptif", "terap", "metoda", "statistik", "deskriptif", "bentuk", "kasuskasus", "deskripsi", "rumus", "statistik", "deskriptif", "contoh", "sistematis"]}, {"kode_matakuliah": "IT011303", "nama_matakuliah": "Algoritma dan Pemrograman 2 A", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja kelompok.", "keterampilan": "Mampu melakukan analisis & desain dengan menggunakan kaidah rekayasa software dan hardware serta algoritma dengan cara menggunakan tools dan dapat menunjukkan hasil dan kondisi yang maksimal untuk aplikasi bisnis; Mampu memahami konsep & teori dasar pemrograman dalam bahasa pemrograman Pascal serta                                  mahasiswa mampu menganalisa dan membuat sebuah program untuk memecahkan suatu masalah dengan menggunakan bahasa pemrograman Pascal.", "pengetahuan": "Menguasai konsep teoritis yang mengkaji, menerapkan dan mengembangkan serta mampu  memformulasikan dan mampu mengambil keputusan yang tepat dalam  penyelesaian masalah. Menguasai konsep teoritis yang mengkaji, menerapkan dan mengembangkan serta mampu  memformulasikan dan mampu mengambil keputusan yang tepat dalam  penyelesaian masalah. Mempunyai pengetahuan dalam penyusunan algoritma pemrograman yang efektif dan efisien serta dapat merancang, membangun dan mengelola aplikasi sistem informasi secara tepat dan akurat untuk pendukung pengambilan keputusan.", "token": ["kuasa", "konsep", "teoritis", "kaji", "terap", "kembang", "formulasi", "ambil", "putus", "selesai", "kuasa", "konsep", "teoritis", "kaji", "terap", "kembang", "formulasi", "ambil", "putus", "selesai", "tahu", "susun", "algoritma", "pemrograman", "efektif", "efisien", "rancang", "bangun", "kelola", "aplikasi", "sistem", "informasi", "akurat", "dukung", "ambil", "putus", "analisis", "desain", "kaidah", "rekayasa", "software", "hardware", "algoritma", "tools", "hasil", "kondisi", "maksimal", "aplikasi", "bisnis", "paham", "konsep", "teori", "dasar", "pemrograman", "bahasa", "pemrograman", "pascal", "mahasiswa", "menganalisa", "program", "pecah", "bahasa", "pemrograman", "pascal"]}, {"kode_matakuliah": "IT012221", "nama_matakuliah": "MEDAN ELEKTROMAGNETIK", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2. Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri. 3. Bertanggung jawabsecara profesionaldan etikterhadap pencapaianhasil kerjaindividu dankelompok. 4. Bersikap sesuai dengan tuntutan profesional. ?", "keterampilan": "Memiliki kemampuan untuk menjelaskan berbagai persamaan yang berkaitan dengan Elektromagnetik, baik fisis maupun matematis; Mampu menggunakan dan menerapkan konsep-konsep teoritis dan empiris dalam menyelesaikan masalah di bidang sistem telekomunikasi.", "pengetahuan": "Memiliki pengetahuan tentang dasar-dasar teori elektromagnetik, penomena gelombang elektromagnetik, karakteristik dan penggunaan dalam Teknologi Telekomunikasi", "token": ["milik", "tahu", "dasardasar", "teori", "elektromagnetik", "penomena", "gelombang", "elektromagnetik", "karakteristik", "guna", "teknologi", "telekomunikasi", "milik", "mampu", "sama", "kait", "elektromagnetik", "fisis", "matematis", "terap", "konsepkonsep", "teoritis", "empiris", "selesai", "bidang", "sistem", "telekomunikasi"]}, {"kode_matakuliah": "IT012245", "nama_matakuliah": "ALGORITMA PEMROGRAMAN 3", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religious 2. Menginternalisasi nilai, norma, dan etika akademik 3. Menunjukkan sikap bertanggungjawab atas pekerjaan dibidang keahliannya secara mandiri", "keterampilan": "Mampu menganalisis, merancang, dan menerapkan suatu sistem berbasis komputer secara efisien untuk menyelesaikan masalah, menggunakan pemrograman prosedural dan berorientasi objek dan menerapkan konsep-konsep yang berkaitan dengan pengembangan berbasis platform pada Mobile Computing, serta mampu mengembangkan program aplikasi berbasis platform untuk berbagai area.", "pengetahuan": "Menguasai bahasa dan algoritma pemrograman yang berkaitan dengan program aplikasi untuk memanipulasi model gambar, grafis dan citra.", "token": ["kuasa", "bahasa", "algoritma", "pemrograman", "kait", "program", "aplikasi", "manipulasi", "model", "gambar", "grafis", "citra", "analis", "rancang", "terap", "sistem", "bas", "komputer", "efisien", "selesai", "pemrograman", "prosedural", "orientasi", "objek", "terap", "konsepkonsep", "kait", "kembang", "bas", "platform", "mobile", "computing", "kembang", "program", "aplikasi", "bas", "platform", "area"]}, {"kode_matakuliah": "IT012256", "nama_matakuliah": "Pengolahan Sinyal Digita;", "sikap": "Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menganalisis, merancang, implementasi pengolahan sinyal digital ke dalam sistem berbasis komputer dan sistem tertanam (Embedded System) yang mencakup perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur;  Mampu melakukan rancang bangun perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.Mampu melakukan rancang bangun perangkat Pengolahan Sinyal Digital dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Mampu mengembangkan pengolahan sinyal digital ke dalam sistem tertanam termasuk perangkat lunak dan mengoptimalkannya; Memiliki pengetahuan yang memadai terkait dengan cara kerja FPGA dan mampu merancang dan mengembangkan berbagai desain produk berbasis digital; Memiliki pengetahuan yang memadai terkait dengan cara kerja sistem komputer dan mampu merancang dan mengembangkan berbagai produk piranti berbasis digital;", "token": ["kembang", "olah", "sinyal", "digital", "sistem", "tanam", "perangkat", "lunak", "optimal", "milik", "tahu", "pada", "kait", "kerja", "fpga", "rancang", "kembang", "desain", "produk", "bas", "digital", "milik", "tahu", "pada", "kait", "kerja", "sistem", "komputer", "rancang", "kembang", "produk", "piranti", "bas", "digital", "analis", "rancang", "implementasi", "olah", "sinyal", "digital", "sistem", "bas", "komputer", "sistem", "tanam", "embedded", "system", "cakup", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "penggunamampu", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "rancang", "bangun", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "penggunamampu", "rancang", "bangun", "perangkat", "olah", "sinyal", "digital", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT012273", "nama_matakuliah": "Rekayasa Perangkat Lunak", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu melakukan rancang bangun perangkat keras dan lunak (embedded system) dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna; Mampu menganalisis, merancang, implementasi sistem berbasis komputer dan sister tertanam (embedded system) yang mencakup baik perangkat keras dan perangkat lunak dengan menggunakan metode, teknik dan alat bantu sesuai kebutuhan pengguna.", "pengetahuan": "Mampu menganalisis, mengevaluasi, memilih dan mengfigurasi platform untuk pengembangan dan implementasi aplikasi perangkat dan pelayanannya.", "token": ["analis", "evaluasi", "pilih", "mengfigurasi", "platform", "kembang", "implementasi", "aplikasi", "perangkat", "layan", "rancang", "bangun", "perangkat", "keras", "lunak", "embedded", "system", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna", "analis", "rancang", "implementasi", "sistem", "bas", "komputer", "sister", "tanam", "embedded", "system", "cakup", "perangkat", "keras", "perangkat", "lunak", "metode", "teknik", "alat", "bantu", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT012275", "nama_matakuliah": "PEMPROGRAMAN MULTIMEDIA", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menggunakan teknik pemrograman untuk mengolah komponen – komponen multimedia dalam pengembangan produk perangkat lunak pada sistem komputer sesuai dengan kebutuhan pengguna; Mampu menganalisa, merancang dan melakukan pemprograman perangkat lunak yang menggunakan komponen multimedia serta penerapannya ke dalam sistem komputer, sistem tertanam (embedded system) dan perangkat bergerak (mobile device) sesuai dengan kebutuhan pengguna", "pengetahuan": "Memiliki pengetahuan yang memadai tentang konsep multimedia dan karakteristik dari komponen multimedia terkait dengan pengembangan berbagai produk perangkat lunak berbasis multimedia.", "token": ["milik", "tahu", "pada", "konsep", "multimedia", "karakteristik", "komponen", "multimedia", "kait", "kembang", "produk", "perangkat", "lunak", "bas", "multimedia", "teknik", "pemrograman", "olah", "komponen", "komponen", "multimedia", "kembang", "produk", "perangkat", "lunak", "sistem", "komputer", "sesuai", "butuh", "guna", "menganalisa", "rancang", "pemprograman", "perangkat", "lunak", "komponen", "multimedia", "terap", "sistem", "komputer", "sistem", "tanam", "embedded", "system", "perangkat", "gerak", "mobile", "device", "sesuai", "butuh", "guna"]}, {"kode_matakuliah": "IT012278", "nama_matakuliah": "KIMIA DASAR", "sikap": "1. Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika; 2. Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; 3. Menginternalisasi nilai, norma, dan etika akademik; 4. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "1. Mahasiswa mampu memahami konsep-konsep dasar ilmu kimia tentang zat dan materi 2. Mahasiswa mampu membuat hubungan konfigurasi elektron dengan sifat-sifat atom, sistem periodik unsur, ikatan kimia dan struktur molekul, 3. Mahasiswa mampu menyelesaikan hitungan-hitungan stoikiometri kimia, 4. Mahasiswa memahami konsep kimia larutan (sifat koligatif dan asam basa), 5. Mahasiswa mampu menyelesaikan permasalahan dalam termokimia & termodinamika 6. Mahasiswa mampu mengatahui dan memahami sifat-sifat umum gas 7. Mahasiswa dapat menjelaskan hubungan antara reaksi kimia dan aliran listrik 8. Mahasiswa dapat menerangkan sifat fisik koloid 9. Mahasiswa dapat memahami terjadinya radiasi zat radioaktif, penggunaannya, efeknya, dan penanggulangan bahayanya. 10. Mahasiswa dapat menjelaskan pengaruh bahan-bahan kimia dan proses kimia terhadap keadaan lingkungan sekitar.", "pengetahuan": "1. Kimia dibangun dengan metode ilmiah yang terdiri dari tahapan proses-proses ilmiah untuk mendapatkan produk ilmiah (konsep, prinsip, aturan dan hukum). 2. Sebagian besar bahan kajian kimia bersifat abstrak oleh sebab itu dalam proses pembelajarannya harus bisa mengkonstruksi model-model atau analogi-analogi yang tepat sehingga ilmu kimia mudah diterima 3. Kimia mengkaji pula soal hitungan, namun hitungan dalam kimia tidak hanya sekedar memecahkan soal-soal yang terdiri dari angka-angka, tetapi soal tersebut berkaitan dengan fakta, aturan, dan hukum dalam kimia sehingga untuk menyelesaikannya pun perlu fakta, aturan dan hukum-hukum tersebut. 4. Konsep-konsep kimia dipelajari dengan urutan tertentu, mulai yang paling sederhana atau mendasar sampai pada yang kompleks. Dengan demikian, maka pembelajaran kimia diperlukan prasyarat pengetahuan yang berhubungan dengan konsep yang akan dibahas sehingga mengetahui kaitan konsep terdahulu dengan konsep yang akan dipelajari. 5. Menguasai teori dan konsep ilmu kimia terutama tentang sifat- sifat kimia dari unsur dan senyawa, reaksi-reaksi kimia unsur, kimia ini dan kimia lingkungan. Menerapkan konsep ilmu kimia dalam bidang elektronika dan komputer", "token": ["kimia", "bangun", "metode", "ilmiah", "tahap", "prosesproses", "ilmiah", "produk", "ilmiah", "konsep", "prinsip", "atur", "hukum", "bahan", "kaji", "kimia", "sifat", "abstrak", "proses", "ajar", "konstruksi", "modelmodel", "analogianalogi", "ilmu", "kimia", "mudah", "terima", "kimia", "kaji", "hitung", "hitung", "kimia", "dar", "pecah", "soalsoal", "angkaangka", "kait", "fakta", "atur", "hukum", "kimia", "selesai", "fakta", "atur", "hukumhukum", "konsepkonsep", "kimia", "ajar", "urut", "sederhana", "dasar", "kompleks", "ajar", "kimia", "prasyarat", "tahu", "hubung", "konsep", "bahas", "kait", "konsep", "konsep", "ajar", "kuasa", "teori", "konsep", "ilmu", "kimia", "sifat", "sifat", "kimia", "unsur", "senyawa", "reaksireaksi", "kimia", "unsur", "kimia", "kimia", "lingkung", "terap", "konsep", "ilmu", "kimia", "bidang", "elektronika", "komputer", "mahasiswa", "paham", "konsepkonsep", "dasar", "ilmu", "kimia", "zat", "materi", "mahasiswa", "hubung", "konfigurasi", "elektron", "sifatsifat", "atom", "sistem", "periodik", "unsur", "ikat", "kimia", "struktur", "molekul", "mahasiswa", "selesai", "hitunganhitungan", "stoikiometri", "kimia", "mahasiswa", "paham", "konsep", "kimia", "larut", "sifat", "koligatif", "asam", "basa", "mahasiswa", "selesai", "masalah", "termokimia", "termodinamika", "mahasiswa", "mengatahui", "paham", "sifatsifat", "gas", "mahasiswa", "hubung", "reaksi", "kimia", "alir", "listrik", "mahasiswa", "terang", "sifat", "fisik", "koloid", "mahasiswa", "paham", "radiasi", "zat", "radioaktif", "guna", "efek", "tanggulang", "bahaya", "mahasiswa", "pengaruh", "bahanbahan", "kimia", "proses", "kimia", "lingkung"]}, {"kode_matakuliah": "IT012315", "nama_matakuliah": "Matematika Dasar 1", "sikap": "Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri. ???????Mengusai konsep teori matematika untuk memecahkan berbagai masalah yang berkaitan dengan logika.", "keterampilan": "Memiliki pengetahuan yang memadai terkait teori-teori dasar matematika dan aplikasinya sehingga mampu mengusai pengembangan ilmu matematika yang digunakan untuk menganalisis sistem berbasis komputer.", "pengetahuan": "Mampu menggunakan dan menerapkan konsep teori matematika dan aplikasinya sebagai penunjang mata kuliah matematika lainnya yang lebih tinggi dalam menyelesaikan masalah di bidang sistem berbasis komputer.", "token": ["terap", "konsep", "teori", "matematika", "aplikasi", "tunjang", "mata", "kuliah", "matematika", "selesai", "bidang", "sistem", "bas", "komputer", "milik", "tahu", "pada", "kait", "teoriteori", "dasar", "matematika", "aplikasi", "usai", "kembang", "ilmu", "matematika", "analis", "sistem", "bas", "komputer"]}, {"kode_matakuliah": "IT012324", "nama_matakuliah": "PENGANTAR TEKNOLOGI INFORMASI ABC", "sikap": "Mengetahui, memahami Pengenalan Tentang Disiplin Ilmu", "keterampilan": "Mampu menganalisa dan menerapkan konsep teknologi informasi untuk memecahkan masalah yang berhubungan dengan sistem komputer;  Mampu memanfaatkan teknologi perangkat keras, perangkat lunak dan jaringan komputer untuk menyelesaikan masalah secara sistematis dan terorganisasi", "pengetahuan": "Mempunyai pengetahuan yang memadai tentang konsep teknologi informasi dan konsep teoritis bidang pengetahuan Sistem Komputer", "token": ["tahu", "pada", "konsep", "teknologi", "informasi", "konsep", "teoritis", "bidang", "tahu", "sistem", "komputer", "menganalisa", "terap", "konsep", "teknologi", "informasi", "pecah", "hubung", "sistem", "komputer", "manfaat", "teknologi", "perangkat", "keras", "perangkat", "lunak", "jaring", "komputer", "selesai", "sistematis", "organisasi"]}, {"kode_matakuliah": "IT012359", "nama_matakuliah": "Jaringan Komputer Dasar", "sikap": "1. Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2. Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika. 3. Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila. 4. Bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan. 5. Menginternalisasi nilai, norma, dan etika akademik. 6. Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri. 7. Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu memahami dan menganalisis permasalahan dalam bidang pengelolaan Sistem berbasis Komputer dan praktik profesional secara umum dan menguasai konsep teoritis dalam bidang teknologi Jaringan komputer; Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, desain atau kritik seni; Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi.", "pengetahuan": "Mampu memahami permasalahan pada bidang pengembangan Sistem berbasis Komputer dan praktik profesional khususnya dalam mengembangkan Jaringan Komputer berbasis Mobile Technology dan Embedded System.", "token": ["paham", "masalah", "bidang", "kembang", "sistem", "bas", "komputer", "praktik", "profesional", "kembang", "jaring", "komputer", "bas", "mobile", "technology", "embedded", "system", "paham", "analis", "masalah", "bidang", "kelola", "sistem", "bas", "komputer", "praktik", "profesional", "kuasa", "konsep", "teoritis", "bidang", "teknologi", "jaring", "komputer", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "desain", "kritik", "seni", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru"]}, {"kode_matakuliah": "IT014240", "nama_matakuliah": "Praktikum Elektronika 1", "sikap": "1.\tBertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius. 2.\tMenunjukkan sikap bertanggung jawab  atas pekerjaan di bidang keahliannya secara mandiri. 3.\tBertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu dan kelompok. 4.\tBersikap sesuai dengan tuntutan profesional.", "keterampilan": "1. Memiliki pengetahuan dan keterampilan  dalam merancang rangkaian Elektronika 1. 2. Mampu merancang, membuat, menguji, rangkaian Elektronika 1. 3. Mampu mengungkapkan hasil pembelajaran praktikum dalam sebuah proyek Elektronika 1 4. Mampu memiliki pengetahuan tentang cara kerja Elektronika 1, fungsi setiap komponen Elektronika 1 , dan mampu merancang Elektronika 1 menjadi satu kesatuan fungsi integrasi dan mampu diaplikasi menjadi satu cara kerja dalam sebuah kerja proyek.", "pengetahuan": "1.\tMengetahui cara kerja rangkaian komponen Elektronika 1 2.\tMengenal komponen penyusun Elektronika 1 3.\tMengetauhi cara membuat rangkaian Elektronika 1 dalam suatu cara kerja aplikasi.", "token": ["kerja", "rangkai", "komponen", "elektronika", "kenal", "komponen", "susun", "elektronika", "mengetauhi", "rangkai", "elektronika", "kerja", "aplikasi", "milik", "tahu", "terampil", "rancang", "rangkai", "elektronika", "rancang", "uji", "rangkai", "elektronika", "hasil", "ajar", "praktikum", "proyek", "elektronika", "milik", "tahu", "kerja", "elektronika", "fungsi", "komponen", "elektronika", "rancang", "elektronika", "satu", "fungsi", "integrasi", "aplikasi", "kerja", "kerja", "proyek"]}, {"kode_matakuliah": "PB 012203", "nama_matakuliah": "Etika Profesi", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius; Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika; Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila;  Berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggung jawab pada negara dan bangsa; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain.", "keterampilan": "Mampu memahami dan menganalisis permasalahan pada isu sosial dan praktik profesional dalam bidang pengelolaan Sistem berbasis Komputer secara umum dan menguasai konsep teoritis dalam bidang pengetahuan tersebut secara mendalam, serta mampu memformulasikan penyelesaian masalah prosedural; Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, desain atau kritik seni; Mampu menyusun deskripsi saintifik hasil kajian tersebut di atas dalam bentuk skripsi atau laporan tugas akhir, dan mengunggahnya dalam laman perguruan tinggi.", "pengetahuan": "Mampu memahami permasalahan pada isu sosial dan praktik profesional dalam bidang pengembangan Sistem berbasis Komputer khususnya dalam mengembangkan Mobile Technology dan Embedded System.", "token": ["paham", "masalah", "isu", "sosial", "praktik", "profesional", "bidang", "kembang", "sistem", "bas", "komputer", "kembang", "mobile", "technology", "embedded", "system", "paham", "analis", "masalah", "isu", "sosial", "praktik", "profesional", "bidang", "kelola", "sistem", "bas", "komputer", "kuasa", "konsep", "teoritis", "bidang", "tahu", "dalam", "formulasi", "selesai", "prosedural", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "desain", "kritik", "seni", "susun", "deskripsi", "saintifik", "hasil", "kaji", "bentuk", "skripsi", "lapor", "tugas", "unggah", "laman", "guru"]}, {"kode_matakuliah": "PB011103", "nama_matakuliah": "Bahasa Indonesia 2", "sikap": "Mampu melakukan bekerjasama dengan orang lain, berkomunikasi dengan baik, serta mampu berargumentasi dengan santun.", "keterampilan": "Mampu membuat tulisan ilmiah dengan kalimat yang efektif sesuai dengan kaidah Ejaan Yang Disempurnakan dan mampu berkomunikasi sesuai kaidah kebahasaan secara lisan maupun tulisan pada forum ilmiah.", "pengetahuan": "Mampu mengorganisasikan tulisan antar paragraph.;Mampu menentukan pilihan kata yang tepat dan menggunakan kata baku  yang berkaitan dengan istilah asing pada bidang teknologi informasi.;Mampu membuat kutipan dengan melakukan paraphrase.;Mampu menulis dan menyusun daftar pustaka", "token": ["organisasi", "tulis", "paragraphmampu", "tentu", "pilih", "baku", "kait", "istilah", "asing", "bidang", "teknologi", "informasimampu", "kutip", "paraphrasemampu", "tulis", "susun", "daftar", "pustaka", "tulis", "ilmiah", "kalimat", "efektif", "sesuai", "kaidah", "eja", "sempurna", "komunikasi", "sesuai", "kaidah", "bahasa", "lisan", "tulis", "forum", "ilmiah"]}, {"kode_matakuliah": "Praktikum", "nama_matakuliah": "AK012124", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius;  Menunjukkan sikap bertanggung jawab atas pekerjaan di bidang keahliannya secara mandiri; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja individu dan kelompok; Bersikap sesuai dengan tuntutan profesional.", "keterampilan": "Mampu menganalisis, mendeteksi, menyelesaikan permasalahan keamananan sebuah jaringan komputer, serta mampu menggunakan tool pendukung sistem jaringan komputer untuk pegelolaan lebih lanjut terhadap konektivitas sumber daya jaringan yang mencakup hubungan perangkat keras dan perangkat lunaknya; Memiliki kemampuan dalam pembangunan dan pemeliharaan sebuah jaringan komputer dalam konteks topologi; Mampu mendeteksi dan menyelesaikan permasalahan keamanan komputer; Mampu melakukan konfigurasi tool jaringan komputer dalam usaha optimalisasi pengembangan jaringan komputer; Paham paham security & monitoring jaringan komputer", "pengetahuan": "Mengetahui dasar-dasar sistem operasi linux; Mengetahui cara-cara penanganan permasalahan keamanan komputer; Mengenal berbagai macam tool pendukung konektivitas jaringan komputer.", "token": ["dasardasar", "sistem", "operasi", "linux", "caracara", "tangan", "masalah", "aman", "komputer", "kenal", "tool", "dukung", "konektivitas", "jaring", "komputer", "analis", "deteksi", "selesai", "masalah", "keamananan", "jaring", "komputer", "tool", "dukung", "sistem", "jaring", "komputer", "pegelolaan", "konektivitas", "sumber", "daya", "jaring", "cakup", "hubung", "perangkat", "keras", "perangkat", "lunak", "milik", "mampu", "bangun", "pelihara", "jaring", "komputer", "konteks", "topologi", "deteksi", "selesai", "masalah", "aman", "komputer", "konfigurasi", "tool", "jaring", "komputer", "usaha", "optimalisasi", "kembang", "jaring", "komputer", "paham", "paham", "security", "monitoring", "jaring", "komputer"]}, {"kode_matakuliah": "AK 045138", "nama_matakuliah": "Pengantar Teknologi Game", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Membuat game computer sederhan; Membuatn game komputer dengan implementasi AI; Mempresentasikan hasil project kemlompok; Mempresentasikan hasil project kemlompok; Membuat laporan hasil kerja yang baik dan dapat menyampaikannya ke pihak lain secara lugas dan jelas; Satu atau lebih program aplikasi game; Menggunakan bahasa pemrograman yang sesuai dengan tujuan pembuatan game; Menggunakan beberapa bahasa pemrograman untuk membuat game.", "pengetahuan": "Menguasai bahasa dan algoritma pemrograman serta teknik yang berkaitan dengan program aplikasi untuk mendesain dan membuat program game; Menguasai konsep-konsep dasar game untuk pemanfaatan game di berbagai bidang yang terkait; Menguasai pemrograman dan logika program dengan konteks yang sesuai serta menggunakan pemikiran yang logis, inovatif dan bertanggung jawab atas hasilnya secara mandiri; Menyelesaikan pekerjaan pemrograman game dengan menggunakan metode pemrograman yang sesuai;Bekerja sama, berkomunikasi dan berinovatif dalam membuat suatu program aplikasi dalam pekerjaannya jika berada dalam suatu tim; Memodifikasi serta mengembangkan program aplikasi game yang sudah ada dan disesuaikan dengan tujuan .", "token": ["kuasa", "bahasa", "algoritma", "pemrograman", "teknik", "kait", "program", "aplikasi", "desain", "program", "game", "kuasa", "konsepkonsep", "dasar", "game", "manfaat", "game", "bidang", "kait", "kuasa", "pemrograman", "logika", "program", "konteks", "sesuai", "pikir", "logis", "inovatif", "tanggung", "hasil", "mandiri", "selesai", "kerja", "pemrograman", "game", "metode", "pemrograman", "sesuaibekerja", "komunikasi", "inovatif", "program", "aplikasi", "kerja", "tim", "modifikasi", "kembang", "program", "aplikasi", "game", "sesuai", "tuju", "game", "computer", "sederhan", "membuatn", "game", "komputer", "implementasi", "ai", "presentasi", "hasil", "project", "kemlompok", "presentasi", "hasil", "project", "kemlompok", "lapor", "hasil", "kerja", "sampai", "lugas", "program", "aplikasi", "game", "bahasa", "pemrograman", "sesuai", "tuju", "buat", "game", "bahasa", "pemrograman", "game"]}, {"kode_matakuliah": "AK 045206", "nama_matakuliah": "Grafik Komputer 2", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Melakukan pembuatan desain animasi 3D dengan menggunakan berbagai teknik animasi; Mengimplementasikan bahasa pemrograman open GL dan Blender untuk pembuatan animasi 3D", "pengetahuan": "Memahami konsep dasar realisme komputer grafik; Menguasai prinsip-prinsip dasar realisme komputer grafik yang meliputi pencahayaan, ray tracing, radiosity, Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.spline, rendering dan pemetaan tekstur.", "token": ["paham", "konsep", "dasar", "realisme", "komputer", "grafik", "kuasa", "prinsipprinsip", "dasar", "realisme", "komputer", "grafik", "liput", "cahaya", "ray", "tracing", "radiosity", "takwa", "tuhan", "maha", "esa", "sikap", "religius", "junjung", "nilai", "manusia", "jalan", "tugas", "dasar", "agama", "moral", "etika", "sikap", "bertanggungjawab", "kerja", "bidang", "ahli", "mandirispline", "rendering", "meta", "tekstur", "buat", "desain", "animasi", "teknik", "animasi", "implementasi", "bahasa", "pemrograman", "open", "gl", "blender", "buat", "animasi"]}, {"kode_matakuliah": "AK 045218", "nama_matakuliah": "Pengantar Kecerdasan Buatan", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Membuat aplikasi game AI yang sederhana; Membuat program sederhana Board Game; Perancangan Game AI dan Menjelaskan konsep Genre Game berbasis AI;", "pengetahuan": "Memahami konsep dasar kecerdasan buatan (Pencarian, Representasi Pengetahuan, dan Penalaran Sederhana) dan tehnik pembuatan game berbasis kecerdasan buatan atau game AI; Menguasai konsep dasar Kecerdasan Buatan (Pencarian, Representasi Pengetahuan, dan Penalaran Sederhana) dan beberapa teknik penyelesaian masalah dalam kecerdasan buatan atau soft computing(Pembelajaran, permainan berbasis kecedasan buatan/game AI );", "token": ["paham", "konsep", "dasar", "cerdas", "buat", "cari", "representasi", "tahu", "nalar", "sederhana", "tehnik", "buat", "game", "bas", "cerdas", "buat", "game", "ai", "kuasa", "konsep", "dasar", "cerdas", "buat", "cari", "representasi", "tahu", "nalar", "sederhana", "teknik", "selesai", "cerdas", "buat", "soft", "computingpembelajaran", "main", "bas", "kecedasan", "buatangame", "ai", "aplikasi", "game", "ai", "sederhana", "program", "sederhana", "board", "game", "ancang", "game", "ai", "konsep", "genre", "game", "bas", "ai"]}, {"kode_matakuliah": "AK 045238", "nama_matakuliah": "Informatika Kesehatan", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Menerapkan Informatika Kesehatan, Milenium Development Goals; melakukan Riset Kesehatan Dasar; Sistem Kesehatan Informasi Nasional; memahami dasar hukum Informatika Kesehatan; Penerapan Sumber data system informatika kesehatan Nasional.", "pengetahuan": "Mengetahui Pengertian Informatika Kesehatan Dan Perbedaan Nya Dengan Informatika Kedokteran; Mengetahui Program Kesehatan Global Dan Nasional; Mengetahui Data Kesehatan Global Dan Nasional;  Mengetahui Sistem Informasi Kesehatan Nasional (Gambaran Umum, Dasar Hukum, Sumber Data, Analisis Data Dan Penyajian Data ); Mengetahui Sistem Informasi Kesehatan Yang Saat Ini Sudah Ada Di Kementerian Kesehatan .", "token": ["erti", "informatika", "sehat", "beda", "nya", "informatika", "dokter", "program", "sehat", "global", "nasional", "data", "sehat", "global", "nasional", "sistem", "informasi", "sehat", "nasional", "gambar", "dasar", "hukum", "sumber", "data", "analisis", "data", "saji", "data", "sistem", "informasi", "sehat", "menteri", "sehat", "terap", "informatika", "sehat", "milenium", "development", "goals", "riset", "sehat", "dasar", "sistem", "sehat", "informasi", "nasional", "paham", "dasar", "hukum", "informatika", "sehat", "terap", "sumber", "data", "system", "informatika", "sehat", "nasional"]}, {"kode_matakuliah": "AK 045329", "nama_matakuliah": "Sistem Basis Data 1", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mengimplementasikan basis data, keamanan data, dan skalabilitas data dalam pemrograman aplikasi;  Mengimplementasikan konsep keamanan basis data pada pemrograman; Mengaplikasikan SQL pada pemrograman ;  Mengaplikasikan hasil perancangan basis data pada pemrograman.", "pengetahuan": "Memahami dan menjelaskan konsep yang berkaitan dengan pemodelan dan abstraksi data, serta membangun aplikasi perangkat lunak perngorganisasian data dan penjaminan keamanan akses data; Menguasai konsep basis data, keamanan data dan skalabilitas data;  Memahami konsep dan teknologi sistem basis data, serta skalabilitas data; Memahami konsep model relasional basis data; Memahami dan menguasai Structured Query Language dan Optimasinya; Menguasai konsep dan prinsip normalisasi, serta perancangan basis data; Memahami konsep PL/SQL dan penerapannya pada Oracle; Memahami konsep unstructured query language / NoSQL dan menerapkan pada MongoDB; Menguasai konsep keamanan basis data", "token": ["paham", "konsep", "kait", "model", "abstraksi", "data", "bangun", "aplikasi", "perangkat", "lunak", "perngorganisasian", "data", "jamin", "aman", "akses", "data", "kuasa", "konsep", "basis", "data", "aman", "data", "skalabilitas", "data", "paham", "konsep", "teknologi", "sistem", "basis", "data", "skalabilitas", "data", "paham", "konsep", "model", "rasional", "basis", "data", "paham", "kuasa", "structured", "query", "language", "optimasinya", "kuasa", "konsep", "prinsip", "normalisasi", "ancang", "basis", "data", "paham", "konsep", "plsql", "terap", "oracle", "paham", "konsep", "unstructured", "query", "language", "nosql", "terap", "mongodb", "kuasa", "konsep", "aman", "basis", "data", "implementasi", "basis", "data", "aman", "data", "skalabilitas", "data", "pemrograman", "aplikasi", "implementasi", "konsep", "aman", "basis", "data", "pemrograman", "aplikasi", "sql", "pemrograman", "aplikasi", "hasil", "ancang", "basis", "data", "pemrograman"]}, {"kode_matakuliah": "AK045214", "nama_matakuliah": "Pemrograman Jaringan", "sikap": "Mampu menunjukkan sikap religius; Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral, dan etika; Meningkatkan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila; Memiliki nasionalisme serta rasa tanggung jawab pada negara dan bangsa; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal; Menginternalisasi nilai, norma, dan etika akademik;  Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan; Memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; Mentaati hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara.", "keterampilan": "Menerapkan konsep yang berkaitan dengan komunikasi data pada jaringan serta membangun aplikasi melalui pemrograman jaringan untuk layanan aplikasi jaringan; Menguasai konsep komunikasi data, aplikasi dan pemrograman jaringan, dan keamanan jaringan;  Mengimplementasikan basis data, keamanan data dan skalabilitas data dalam pemrograman aplikasi;", "pengetahuan": "Menguasai tentang pemahaman tentang terapan aplikasi dan pemrograman jaringan, pembahasan diawali dengan pemahaman konsep komunikasi data dan jaringan Internet dan dilanjutkan dengan pemahaman pembangunan aplikasi dalam jaringan termasuk keamanan jaringan.", "token": ["kuasa", "paham", "terap", "aplikasi", "pemrograman", "jaring", "bahas", "awal", "paham", "konsep", "komunikasi", "data", "jaring", "internet", "lanjut", "paham", "bangun", "aplikasi", "jaring", "aman", "jaring", "terap", "konsep", "kait", "komunikasi", "data", "jaring", "bangun", "aplikasi", "pemrograman", "jaring", "layan", "aplikasi", "jaring", "kuasa", "konsep", "komunikasi", "data", "aplikasi", "pemrograman", "jaring", "aman", "jaring", "implementasi", "basis", "data", "aman", "data", "skalabilitas", "data", "pemrograman", "aplikasi"]}, {"kode_matakuliah": "AK045223", "nama_matakuliah": "Sistem Terdistribusi", "sikap": "-", "keterampilan": "Mampu mengidentifikasi kebutuhan sistem terdistribusi dari suatu organisasi pada sistem terdistribusi; Mampu merancang basis data terdistribusi dan mengaplikasikannya pada sistem terdistribusi.", "pengetahuan": "Menguasai konsep, model, arsitektur dan perangkat keras yang ada pada suatu sistem terdistribusi; Mengetahui berbagai bentuk media komunikasi dan jaringan komputer yang merupakan bagian dari kemajuan teknologi informasi dan komunikasi. Menguasai konsep komunikasi antar proses, konsep basisdata terdistribusi, distribusi pemrosesan, konsep sistem operasi terdistribusi, dan konsep keamanan pada sistem terdistribusi.  Mengetahui bentuk dan cara pengembangan sistem terdistribusi.", "token": ["kuasa", "konsep", "model", "arsitektur", "perangkat", "keras", "sistem", "distribusi", "bentuk", "media", "komunikasi", "jaring", "komputer", "maju", "teknologi", "informasi", "komunikasi", "kuasa", "konsep", "komunikasi", "proses", "konsep", "basisdata", "distribusi", "distribusi", "pemrosesan", "konsep", "sistem", "operasi", "distribusi", "konsep", "aman", "sistem", "distribusi", "bentuk", "kembang", "sistem", "distribusi", "identifikasi", "butuh", "sistem", "distribusi", "organisasi", "sistem", "distribusi", "rancang", "basis", "data", "distribusi", "aplikasi", "sistem", "distribusi"]}, {"kode_matakuliah": "AK045231", "nama_matakuliah": "Sistem Informasi", "sikap": "Memahami Konsep Sistem Informasi, sistem informasi berbasis komputer dalam organisasi dan pendekatan sistem informasi dlam disiplin ilmu.", "keterampilan": "Mampu menerapkan konsep dasar HIPO dan perbedaan dari tiap jenis diagram yang ada dalam HIPO, mahasiswa diharapkan dapat menggunakan HIPO untuk mendokumentasikan program dan menggambarkan hirarki dari sistem yang sedang mereka kembangkan, dan mahasiswa mengetahui kelebihan dan kekurangan HIPO; Dapat menerapkan konsep dasar structure chart (bagan terstruktur) sebagai alat untuk menggambarkan hirarki dari sistem yang sedang dikembangkan, mahasiswa diharapkan dapat membuat structure chart, dan Mahasiswa mengetahui kelebihan dan kekurangan structure chart.", "pengetahuan": "Mengetahui hal-hal yang dipahami untuk mengimplementasikan sebuah permasahalan dalam system informasi dengan menguasai system pendekatan terstruktur dan tahapan dari pengembangan system informasi; Memecahkan permasalahan Sistem informasi dengan menerapkan fase-fase dari siklus hidup pengembangan sistem dan membuat system menggunakan pendekatan terstruktur", "token": ["halhal", "paham", "implementasi", "permasahalan", "system", "informasi", "kuasa", "system", "dekat", "struktur", "tahap", "kembang", "system", "informasi", "pecah", "masalah", "sistem", "informasi", "terap", "fasefase", "siklus", "hidup", "kembang", "sistem", "system", "dekat", "struktur", "terap", "konsep", "dasar", "hipo", "beda", "jenis", "diagram", "hipo", "mahasiswa", "harap", "hipo", "dokumentasi", "program", "gambar", "hirarki", "sistem", "kembang", "mahasiswa", "lebih", "kurang", "hipo", "terap", "konsep", "dasar", "structure", "chart", "bagan", "struktur", "alat", "gambar", "hirarki", "sistem", "kembang", "mahasiswa", "harap", "structure", "chart", "mahasiswa", "lebih", "kurang", "structure", "chart"]}, {"kode_matakuliah": "AK045307", "nama_matakuliah": "INTERAKSI MANUSIA DAN KOMPUTER", "sikap": "Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Bertanggung jawab secara profesional dan etik terhadap pencapaian hasil kerja kelompok", "keterampilan": "Mahasiswa mampu memahami pendekatan tingkah laku manusia dalam 2 aspek yaitu  psikologi dan social organisasi dengan obyek obyek interaktif. Mampu merancang dan mengevaluasi obyek yang interaktif. Serta mampu memahami pendekatan human centered.", "pengetahuan": "Mahasiswa memiliki pengetahuan tentang konsep teoritis interaksi manusia dan komputer, konsep perancangan dan analisis interface/web, konsep evaluasi interface/web konsep pemrograman GUI serta konsep multimedia. Sehingga memiliki pengetahuan yang lengkap dalam proses perancangan suatu interface dalam sebuah prototype dan menganalisis sebuah web  dalam   implementasi interaksi manusia dan komputer yang baik dan diharapkan oleh manusia sebagai user.", "token": ["mahasiswa", "milik", "tahu", "konsep", "teoritis", "interaksi", "manusia", "komputer", "konsep", "ancang", "analisis", "interfaceweb", "konsep", "evaluasi", "interfaceweb", "konsep", "pemrograman", "gui", "konsep", "multimedia", "milik", "tahu", "lengkap", "proses", "ancang", "interface", "prototype", "analis", "web", "implementasi", "interaksi", "manusia", "komputer", "harap", "manusia", "user", "mahasiswa", "paham", "dekat", "tingkah", "laku", "manusia", "aspek", "psikologi", "social", "organisasi", "obyek", "obyek", "interaktif", "rancang", "evaluasi", "obyek", "interaktif", "paham", "dekat", "human", "centered"]}, {"kode_matakuliah": "AK045330", "nama_matakuliah": "Sistem Basis Data 2", "sikap": "Integritas, keamanan dan tingkat kerahasiaan data pada suatu basis data", "keterampilan": "Merancang basis data sesuai dengan kebutuhan organisasi;Mengimplementasikan rancangan basis data pada suatu DBMS", "pengetahuan": "Mampu menjelaskan prinsip-prinsip dasar dalam pengembangan basis data; Mengidentifikasi dan merancang basis data sesuai dengan kebutuhan organisasi.", "token": ["prinsipprinsip", "dasar", "kembang", "basis", "data", "identifikasi", "rancang", "basis", "data", "sesuai", "butuh", "organisasi", "rancang", "basis", "data", "sesuai", "butuh", "organisasimengimplementasikan", "rancang", "basis", "data", "dbms"]}, {"kode_matakuliah": "IT 045216", "nama_matakuliah": "Matematika Informatika 4", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Mampu menyelesaian masalah relasi rekursi dengan cara iterasi dan induksi Tabel Diferensi; Penyajian graf berarah, Definisi-definisi dasar pada graf berarah, Keterhubungan dalam graf berarah, Matriks dan graf berarah, Pemodelan masalah dengan graf berarah : Masalah jalur terpendek; Dapat melakukan Pemodelan masalah dengan graf berarah, yaitu masalah aliran maksimal (max flow); Menerapkan algoritma dan kriteria algoritma yang baik, Analisis suatu algoritma. Pengertian dan keadaan kompleksitas waktu.", "pengetahuan": "Menguasai fungsi umum relasi rekursi, teori graf, tree dan kompleksitas algoritma; Mengetahui tentang Pengertian Relasi Rekursi, Jenis-jenis Relasi Rekursi, barisan Fibonacci dan pemodelan masalah dalam Relasi Rekursi; Mengetahui tentang pengertian Relasi rekursi linier berkoefisien konstan, Jawab homogen dari relasi rekursi,Persamaan karakteristik berakar ganda; Mengetahui tentang Jawab khusus relasi rekursi, Jawab keseluruhan relasi rekursi; Dapat menjelaskan tentang Kelahiran teori graf, graf secara formal, subgraf, keterhubungan graf, operasi pada graf, matriks dan graf; Mengetahui tentang pengertian Graf berlabel, pemodelan masalah dengan konsep graf berlabel, masalah lintasan Euler, Travelling Salesman Problem; Mengetahui tentang definisi Graf Planar, Map dan region, Pewarnaan Graf, Algoritma Welch-Powell.", "token": ["kuasa", "fungsi", "relasi", "rekurs", "teori", "graf", "tree", "kompleksitas", "algoritma", "erti", "relasi", "rekurs", "jenisjenis", "relasi", "rekurs", "baris", "fibonacci", "model", "relasi", "rekurs", "erti", "relasi", "rekurs", "linier", "koefisien", "konstan", "homogen", "relasi", "rekursipersamaan", "karakteristik", "akar", "ganda", "khusus", "relasi", "rekurs", "relasi", "rekurs", "lahir", "teori", "graf", "graf", "formal", "subgraf", "hubung", "graf", "operasi", "graf", "matriks", "graf", "erti", "graf", "label", "model", "konsep", "graf", "label", "lintas", "euler", "travelling", "salesman", "problem", "definisi", "graf", "planar", "map", "region", "warna", "graf", "algoritma", "welchpowell", "selesai", "relasi", "rekurs", "iterasi", "induksi", "tabel", "diferensi", "saji", "graf", "arah", "definisidefinisi", "dasar", "graf", "arah", "hubung", "graf", "arah", "matriks", "graf", "arah", "model", "graf", "arah", "jalur", "pendek", "model", "graf", "arah", "alir", "maksimal", "max", "flow", "terap", "algoritma", "kriteria", "algoritma", "analisis", "algoritma", "erti", "kompleksitas"]}, {"kode_matakuliah": "IT 045234", "nama_matakuliah": "Pengantar Forensik Teknologi Informasi", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Memahami  penerapan konsep Disk Forensik serta melakukan ekstraksi seluruh informasi pada media penyimpanan sebagai bahan pengembangan sistem maupun barang bukti digital; menerapkan konsep Mobile Forensik, Jenis-jenis Mobile device serta perangkat lunak yang dapat digunakan; Menerapkan mekanisme forensik pada jaringan dan internet sehingga bukti-bukti yang dibutuhkan untuk analisa lebih lanjut tidak hilang atau berubah; Memahami perangkat untuk menganalisis bukti digital dan lalu lintas jaringan akses yang tidak sah pada sistem komputer; Memahami aplikasi forensik yang dapat digunakan untuk komputer forensik Tujuan Instruksional Khusus (TIK).", "pengetahuan": "Menguasai pengetahuan tentang forensik TI meliputi cybercrime, isu keamanan di dunia TI, peraturan dan perundangan yang berlaku baik di Indonesia maupun internasional, dan analisa serta penanganannya; Mengetahui dan memahami konsep tentang cybercrime, dasar hukum, metodologi, serta tahapan dalam pembuatan laporan di forensik TI; Mengimplementasikan pengetahuan tentang forensik TI meliputi cybercrime, isu keamanan di dunia TI, peraturan dan perundangan yang berlaku baik di Indonesia maupun internasional, dan analisa serta penanganannya.", "token": ["kuasa", "tahu", "forensik", "ti", "liput", "cybercrime", "isu", "aman", "dunia", "ti", "atur", "undang", "laku", "indonesia", "internasional", "analisa", "tangan", "paham", "konsep", "cybercrime", "dasar", "hukum", "metodologi", "tahap", "buat", "lapor", "forensik", "ti", "implementasi", "tahu", "forensik", "ti", "liput", "cybercrime", "isu", "aman", "dunia", "ti", "atur", "undang", "laku", "indonesia", "internasional", "analisa", "tangan", "paham", "terap", "konsep", "disk", "forensik", "ekstraksi", "informasi", "media", "simpan", "bahan", "kembang", "sistem", "barang", "bukti", "digital", "terap", "konsep", "mobile", "forensik", "jenisjenis", "mobile", "device", "perangkat", "lunak", "terap", "mekanisme", "forensik", "jaring", "internet", "buktibukti", "butuh", "analisa", "hilang", "ubah", "paham", "perangkat", "analis", "bukti", "digital", "lintas", "jaring", "akses", "sah", "sistem", "komputer", "paham", "aplikasi", "forensik", "komputer", "forensik", "tuju", "instruksional", "khusus", "tik"]}, {"kode_matakuliah": "IT 045240", "nama_matakuliah": "Pengantar Alogoritma Deep Learning", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Melakukan pengembangan program aplikasi dan mengimplementasikannya secara sistematis pada sejumlah kasus sederhana dengan menggunakan algoritma deep learning , yang dapat digunakan dalam pemodelan dan perancangan aplikasi di bidang teknologi informasi;  mengimplementasikan arsitektur Convolutional Neural Netwok (CNN); Memahami lebih dalam dan mengimplementasikan arsitektur Recurrent Neural Network (RNN) dan Long Short Term Memory (LSTM); Memahami lebih dalam dan mengimplementasikan arsitektur Restricted Boltzman Machine (RBM);  Memahami lebih dalam dan mengimplementasikan arsitektur Autoencoder (AE).", "pengetahuan": "Memahami dan menjelaskan konsep-konsep Deep Learning, penggunaan model-model deep learning diserta dengan pemanfataan teknologi untuk melakukan pengolahan deep leanring; Memahami dan menjelaskan mengenai penerapan deep leanring pada kehidupan sehari-hari; Memahami dan menjelaskan analisa hasil dan proses pada deep learning berdasarkan akurasi data dari masingmasing model;", "token": ["paham", "konsepkonsep", "deep", "learning", "guna", "modelmodel", "deep", "learning", "serta", "pemanfataan", "teknologi", "olah", "deep", "leanring", "paham", "terap", "deep", "leanring", "hidup", "seharihari", "paham", "analisa", "hasil", "proses", "deep", "learning", "dasar", "akurasi", "data", "masingmasing", "model", "kembang", "program", "aplikasi", "implementasi", "sistematis", "sederhana", "algoritma", "deep", "learning", "model", "ancang", "aplikasi", "bidang", "teknologi", "informasi", "implementasi", "arsitektur", "convolutional", "neural", "netwok", "cnn", "paham", "implementasi", "arsitektur", "recurrent", "neural", "network", "rnn", "long", "short", "term", "memory", "lstm", "paham", "implementasi", "arsitektur", "restricted", "boltzman", "machine", "rbm", "paham", "implementasi", "arsitektur", "autoencoder", "ae"]}, {"kode_matakuliah": "IT 045241", "nama_matakuliah": "Pengelolaan Proyek Perangkat Lunak", "sikap": "Bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius serta menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika dengan menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri.", "keterampilan": "Dapat menggunakan konsep pengelolaan proyek perangkat lunak dalam menyelesaikan masalah di bidang ilmu komputer; Mampu m enerapkan perencanaan pengelolaan proyek perangkat lunak dalam menyelesaikan masalah individu atau oraganisasi.", "pengetahuan": "Mampu menerapkan konsep-konsep dasar komputer yang dibutuhkan dalam mengkonfigurasi, mengelola dan mengintegrasikan sumber daya teknologi Informasi.", "token": ["terap", "konsepkonsep", "dasar", "komputer", "butuh", "konfigurasi", "kelola", "integrasi", "sumber", "daya", "teknologi", "informasi", "konsep", "kelola", "proyek", "perangkat", "lunak", "selesai", "bidang", "ilmu", "komputer", "enerapkan", "rencana", "kelola", "proyek", "perangkat", "lunak", "selesai", "individu", "oraganisasi"]}, {"kode_matakuliah": "IT045227", "nama_matakuliah": "Statistika 1", "sikap": "Mampu menunjukkan internalisasi nilai, norma, dan etika akademik; Mampu menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Mampu menunjukkan internalisasi semangat kemandirian, kejuangan, dan kewirausahaan", "keterampilan": "Mampu meningkatkan kompetensi mahasiswa melalui proses belajar secara centered learning dan mutakhir dengan dukungan TIK di Program studi Sistem Informasi  jenjang strata-1 Fakultas Ilmu Komputer dan Teknologi Informasi Universitas Gunadarma; Mampu membekali mahasiswa dengan pemahaman aspek-aspek Statistika Deskriptif dan cara penerapan metoda Statistik Deskriptif dalam bentuk kasus-kasus; Mampu mendeskripsikan, merumuskan dan menjelaskan Statistik Deskriptif dan contoh kasus tersebut dengan baik dan sistematis.", "pengetahuan": "Membekali mahasiswa agar lebih paham dan menguasai teori terkait  data dan cara pengumpulan data melalui pengumpulan data secara mandiri oleh mahasiswa.", "token": ["bekal", "mahasiswa", "paham", "kuasa", "teori", "kait", "data", "kumpul", "data", "kumpul", "data", "mandiri", "mahasiswa", "tingkat", "kompetensi", "mahasiswa", "proses", "ajar", "centered", "learning", "mutakhir", "dukung", "tik", "program", "studi", "sistem", "informasi", "jenjang", "strata", "fakultas", "ilmu", "komputer", "teknologi", "informasi", "universitas", "gunadarma", "bekal", "mahasiswa", "paham", "aspekaspek", "statistika", "deskriptif", "terap", "metoda", "statistik", "deskriptif", "bentuk", "kasuskasus", "deskripsi", "rumus", "statistik", "deskriptif", "contoh", "sistematis"]}, {"kode_matakuliah": "PB 045202", "nama_matakuliah": "Legal Aspek Produk Teknologi Informasi dan Komunikasi", "sikap": "Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; Menaati hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; Menunjukkan sikap bertanggung atas pekerjaan di bidang keahliannya secara mandiri;", "keterampilan": "Menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Menunjukkan kinerja mandiri, bermutu dan terukur; mengkaji kasus penerpan ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora sesuai dengan bidang keahliannya dalam dalam rangka menghasilkanan prototype, prosedur baku, desain atau karya seni, menyusun hasil kajiannya dalam bentuk kertas kerja, spesifikasi desain, atau esai seni,dan mengunggahnya dalam laman perguruan tinggi; Mampu memelihara dan mengembangkan jaringan kerja sama dan hasil kerja sama di dalam maupun di luar lembaganya;", "pengetahuan": "Memiliki pengetahuan mengenai Teknologi Informasi dan Komunikasi (TIK); Memiliki pengetahuan mengenai legal aspek; Memiliki pengetahuan dan keterampilan dalam pengelolaan produk TIK; Memiliki pengetahuan dan keterampilan tentang Hak Kekayaan Intelektual (HKI) (Intelectual Property) dan klasifikasinya di Indonesia serta Internasional;", "token": ["milik", "tahu", "teknologi", "informasi", "komunikasi", "tik", "milik", "tahu", "legal", "aspek", "milik", "tahu", "terampil", "kelola", "produk", "tik", "milik", "tahu", "terampil", "hak", "kaya", "intelektual", "hki", "intelectual", "property", "klasifikasi", "indonesia", "internasional", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "kerja", "mandiri", "mutu", "ukur", "kaji", "pan", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "rangka", "menghasilkanan", "prototype", "prosedur", "baku", "desain", "karya", "seni", "susun", "hasil", "kaji", "bentuk", "kertas", "kerja", "spesifikasi", "desain", "esai", "senidan", "unggah", "laman", "guru", "pelihara", "kembang", "jaring", "kerja", "hasil", "kerja", "lembaga"]}, {"kode_matakuliah": "IT-081339", "nama_matakuliah": "Cyber Public Relations", "sikap": "1. Bertaqwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius ; Menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama, moral dan etika komunikasi; Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; Berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; Menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; Bekerjasama dan memiliki kepekaan social serta kepedulian terhadap masyarakat dan lingkungan; Taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri terutama dalam bidang komunikasi.", "keterampilan": "1. Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang komunikasi; Mampu menunjukkan kinerja mandiri, bermutu, dan terukur; Mampu mengkaji implikasi pengembangan atau implementasi ilmu pengetahuan teknologi yang memperhatikan dan menerapkan nilai humaniora sesuai dengan keahliannya berdasarkan kaidah, tata cara dan etika ilmiah dalam rangka menghasilkan solusi, gagasan, desain atau kritik seni; Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah di bidang keahliannya, berdasarkan hasil analisis informasi dan data; Mampu memelihara dan mengembangkan jaringan kerja dengan pembimbing, kolega, sejawat baik di dalam maupun di luar lembaganya; Mampu bertanggungjawab atas pencapaian hasil kerja kelompok dan melakukan supervisi dan evaluasi terhadap penyelesaian pekerjaan yang ditugaskan kepada pekerja yang berada di bawah tanggungjawabnya; Mampu melakukan proses evaluasi diri terhadap kelompok kerja yang berada dibawah tanggung jawabnya, dan mampu mengelola pembelajaran secara mandiri; Mahasiswa mampu memahami mata kuliah cyber public relations, yang di dalamnya mempelajari perkembangan kajian public relations, media digital, marketing public relations, etika public relations, serta riset bagi pengembangan kajian digital public relations.", "pengetahuan": "Mahasiswa menguasai secara mendalam mengenai : Era digital 4.0; Digital public relations; Digital Media; Media sosial; Digital public relations stakeholders; Stakeholders relations (customer, employee, investor, community, government); Corporate Communication; Marketing public relations; Public Relations Writing on Net; Endorsement sebagai public relations tools; Kompetensi public relations officer di era digital; Etika public relations di era digital; peluang karir profesi public relations; Riset digital public relations", "token": ["mahasiswa", "kuasa", "dalam", "era", "digital", "digital", "public", "relations", "digital", "media", "media", "sosial", "digital", "public", "relations", "stakeholders", "stakeholders", "relations", "customer", "employee", "investor", "community", "government", "corporate", "communication", "marketing", "public", "relations", "public", "relations", "writing", "on", "net", "endorsement", "public", "relations", "tools", "kompetensi", "public", "relations", "officer", "era", "digital", "etika", "public", "relations", "era", "digital", "peluang", "karir", "profesi", "public", "relations", "riset", "digital", "public", "relations", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "komunikasi", "kerja", "mandiri", "mutu", "ukur", "kaji", "implikasi", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "ahli", "dasar", "kaidah", "tata", "etika", "ilmiah", "rangka", "hasil", "solusi", "gagas", "desain", "kritik", "seni", "ambil", "putus", "konteks", "selesai", "bidang", "ahli", "dasar", "hasil", "analisis", "informasi", "data", "pelihara", "kembang", "jaring", "kerja", "bimbing", "kolega", "jawat", "lembaga", "bertanggungjawab", "capai", "hasil", "kerja", "kelompok", "supervisi", "evaluasi", "selesai", "kerja", "tugas", "kerja", "tanggungjawabnya", "proses", "evaluasi", "kelompok", "kerja", "bawah", "tanggung", "kelola", "ajar", "mandiri", "mahasiswa", "paham", "mata", "kuliah", "cyber", "public", "relations", "dalam", "ajar", "kembang", "kaji", "public", "relations", "media", "digital", "marketing", "public", "relations", "etika", "public", "relations", "riset", "kembang", "kaji", "digital", "public", "relations"]}, {"kode_matakuliah": "IT081334", "nama_matakuliah": "Algoritma & Pemrograman 1 (Scratch)", "sikap": "Berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan peradaban berdasarkan Pancasila; Bekerjasama dan memiliki kepekaan social serta kepedulian terhadap masyarakat dan lingkungan; Menginternalisasi nilai, norma, dan etika akademik; Menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; Menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "keterampilan": "Mampu menerapkan pemikiran logis, kritis, sistematis, dan inovatif dalam konteks pengembangan atau implementasi ilmu pengetahuan dan teknologi yang memperhatikan dan menerapkan nilai humaniora yang sesuai dengan bidang keahliannya; Mampu mengambil keputusan secara tepat dalam konteks penyelesaian masalah di bidang keahliannya, berdasarkan hasil analisis informasi dan data; Mampu mendokumentasikan, menyimpan, mengamankan, dan menemukan kembali data untuk menjamin kesahihan dan mencegah plagiasi; Mampu mengembangkan aplikasi komunikasi multimedia berbasis TIK dalam konteks beragam budaya; Mampu menggunakan teknik visual merchandising untuk meningkatkan minat penawaran produk, menerapkan teknik display untuk menarik pelanggan dan meningkatkan potensi penjualan; Mahasiswa mampu membuat simulasi pembelajaran; Mahasiswa mampu membuat game sederhana.", "pengetahuan": "Memiliki pengetahuan dan wawasan tentang luas pengaruh ilmu komunikasi dalam konteks kehidupan sosial, budaya, ekonomi dan politik; Mempunyai pengetahuan  dan keterampilan merencanakan, menerapkan dan mengevaluasi program  komunikasi dalam berbagai konteks komunikasi; Memiliki keterampilan dalam memanfaatkan kemajuan teknologi komunikasi dan memahami efek sosial-komunikasi yang ditimbulkan akibat pemanfaatan teknologi tersebut; Memiliki pengetahuan dan keterampilan dalam pengelolaan sistem informasi dan komunikasi sesuai kebutuhan profesi dan organisasi; Mengetahui proses komunikasi mulai dari  hubungan  interpersonal sampai organisasional baik secara tatap muka maupun berbasis teknologi informasi dan komunikasi (TIK); Mengetahui teknik mendisain web, menghasilkan konten atau produk-produk media yang memiliki nilai kreatifitas dan obyektif.", "token": ["milik", "tahu", "wawas", "luas", "pengaruh", "ilmu", "komunikasi", "konteks", "hidup", "sosial", "budaya", "ekonomi", "politik", "tahu", "terampil", "rencana", "terap", "evaluasi", "program", "komunikasi", "konteks", "komunikasi", "milik", "terampil", "manfaat", "maju", "teknologi", "komunikasi", "paham", "efek", "sosialkomunikasi", "timbul", "akibat", "manfaat", "teknologi", "milik", "tahu", "terampil", "kelola", "sistem", "informasi", "komunikasi", "sesuai", "butuh", "profesi", "organisasi", "proses", "komunikasi", "hubung", "interpersonal", "organisasional", "tatap", "muka", "bas", "teknologi", "informasi", "komunikasi", "tik", "teknik", "disain", "web", "hasil", "konten", "produkproduk", "media", "milik", "nilai", "kreatifitas", "obyektif", "terap", "pikir", "logis", "kritis", "sistematis", "inovatif", "konteks", "kembang", "implementasi", "ilmu", "tahu", "teknologi", "perhati", "terap", "nilai", "humaniora", "sesuai", "bidang", "ahli", "ambil", "putus", "konteks", "selesai", "bidang", "ahli", "dasar", "hasil", "analisis", "informasi", "data", "dokumentasi", "simpan", "aman", "temu", "data", "jamin", "sahih", "cegah", "plagiasi", "kembang", "aplikasi", "komunikasi", "multimedia", "bas", "tik", "konteks", "agam", "budaya", "teknik", "visual", "merchandising", "tingkat", "minat", "tawar", "produk", "terap", "teknik", "display", "tarik", "langgan", "tingkat", "potensi", "jual", "mahasiswa", "simulasi", "ajar", "mahasiswa", "game", "sederhana"]}, {"kode_matakuliah": "PB-081207", "nama_matakuliah": "Bahasa Indonesia", "sikap": "Berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme, rasa tanggungjawab pada negara dan bangsa, serta bangga menggunakan Bahasa Indonesia; Menginternalisasi nilai, norma, dan etika di dalam proses belajar  Bahasa Indonesia ; Menunjukkan sikap bertanggung jawab atas karya tulis ilmiah secara mandiri; Memahami pentingnya prinsip-prinsip etika menulis ilmiah dalam lingkup formal pada bidang Ilmu Komunikasi.", "keterampilan": "Mahasiswa mampu menjelaskan kaidah berbahasa Indonesia yang baik dan benar. Melalui  penguasaan Bahasa Indonesia secara tepat, menunjukkan bahwa mahasiswa mampu mengorganisasikan ide-ide untuk dikomunikasikan kepada pihak lain sehingga menghasilkan proses transfer ilmu dan pengelolaan yang efektif; Mahasiswa mampu memecahkan masalah, dan mampu menyampaikan ide dan gagasannya secara efektif. Mahasiswa diharapkan mampu memiliki ketrampilan komunikasi yang tinggi dalam bidang ilmu pengetahuan. Melalui mata kuliah Bahasa Indonesia  diharapkan mahasiswa mampu berkomunikasi  dengan baik dalam Bahasa Indonesia.", "pengetahuan": "Mahasiswa menguasai secara mendalam pengetahuan tentang: Konsep Bahasa dan Fungsi Bahasa; Ragam dan Laras Bahasa; Penulisan Ejaan dan Tanda Baca; Diksi dan istilah dalam bahasa Indonesia; Kalimat dan Kalimat Efektif dalam penulisan; Paragraf dalam Teks; Jenis Tulisan; Ringkasan, Abstrak, dan Sintesis; Topik, Tujuan, Tesis, dan Kerangka Karangan; Membuat Karya Tulis Ilmiah; Membuat Outline; Sumber Penelitian; Proses Penyusunan Karya Ilmiah", "token": ["mahasiswa", "kuasa", "dalam", "tahu", "konsep", "bahasa", "fungsi", "bahasa", "ragam", "laras", "bahasa", "tulis", "eja", "tanda", "baca", "diksi", "istilah", "bahasa", "indonesia", "kalimat", "kalimat", "efektif", "tulis", "paragraf", "teks", "jenis", "tulis", "ringkas", "abstrak", "sintesis", "topik", "tuju", "tesis", "kerangka", "karang", "karya", "tulis", "ilmiah", "outline", "sumber", "teliti", "proses", "susun", "karya", "ilmiah", "mahasiswa", "kaidah", "bahasa", "indonesia", "kuasa", "bahasa", "indonesia", "mahasiswa", "organisasi", "ideide", "komunikasi", "hasil", "proses", "transfer", "ilmu", "kelola", "efektif", "mahasiswa", "pecah", "ide", "gagas", "efektif", "mahasiswa", "harap", "milik", "ketrampilan", "komunikasi", "bidang", "ilmu", "tahu", "mata", "kuliah", "bahasa", "indonesia", "harap", "mahasiswa", "komunikasi", "bahasa", "indonesia"]}, {"kode_matakuliah": "PB-081999", "nama_matakuliah": "Matkul Mesin 1", "sikap": "Contoh sikap", "keterampilan": "Contoh keterampilan", "pengetahuan": "Contoh pengetahuan", "token": ["contoh", "tahu", "contoh", "terampil"]}]
